{
  "pages": [
    {
      "link": "/stories.html",
      "name": "Stories"
    },
    {
      "link": "/majors.html",
      "name": "Majors"
    },
    {
      "link": "/connect.html",
      "name": "Connect"
    },
    {
      "link": "/projects.html",
      "name": "Projects"
    },
    {
      "link": "/resources.html",
      "name": "Resources"
    }
  ],
  "stories": [
    {
      "name": "Jasmine Wang",
      "class": "2016",
      "quote": "In CogSci, we learn about the brain and the connection between neurons. We can start thinking about Artificial Intelligence and build something that can simulate the brain. If you’re even slightly interested in CogSci, take a leap of faith — I bet you’ll fall in love with it.",
      "image": "/img/JasmineWang.jpg",
      "link": "https://www.youtube.com/watch?v=AAcQylywrYE"
    },
    {
      "name": "Sarah Guthals",
      "role": "Professor | Co-founder of ThoughtSTEM",
      "class": "2014",
      "quote": "I wanted to solve problems. A friend of mine told me to try a computer science class. So I took CSE 8A with Professor Beth Simon and I absolutely fell in love. I had no clue what I was doing. I would sit in the labs completely lost, but I loved it because there was always a process to follow. There was always a way of figuring it out.",
      "image": "/img/SarahGuthals.jpg",
      "link": "https://www.youtube.com/watch?v=zcbtzVPsuoE"
    },
    {
      "name": "Tom Erbe",
      "role": "Professor",
      "quote": "You might not know exactly where you’re going, but keep your interests in the forefront and things will open up. When I went to school, you couldn’t integrate art and technology in any meaningful way, but I found a position where I could do this. You find these opportunities and you weigh what’s important.",
      "image": "/img/TomErbe.jpg",
      "link": "https://www.youtube.com/watch?v=3EjVR7pldvI"
    },
    {
      "name": "Sneha Jayaprakash",
      "class": "2016",
      "quote": "I thought that bioinformatics was more bioengineering focused, but I found that it was much more focused on computation. I realized that bioinformatics is  a major where doing four years of undergrad isn’t enough. It helps to have a more solid foundation, so getting a master’s or PhD would help a lot for students who want to pursue that later.",
      "image": "/img/SnehaJayaprakash.jpg",
      "link": "https://www.youtube.com/watch?v=W4phVBHBhxY"
    },
    {
      "name": "Jason Sandoval",
      "role": "Veteran | Arista Networks Engineer",
      "quote":"I transferred in to UCSD from Mesa college. Before that, I was in the Air Force for 9 years. When I was in the Air Force, I had the chance to train into a different job so I decided to try programming. Programing in the Air Force is not “real programming”. It’s a little strange, but I got a little taste of it. So when I got out of the Air Force, did some contract work, and decided I wanted to do something else; that’s why I headed to programming.",
      "image": "/img/JasonSandoval.jpg",
      "link": "https://www.youtube.com/watch?v=WNtRl2kWOGQ"
    },
    {
      "name": "Ben Breidenthal",
      "class": "2016",
      "quote":"I didn’t do any programming until I took beginning Java classes at Mira Costa, but I wasn’t really into it. But once I took MUS 176 with Tom Erbe, and we looked at C++ and making audio effects plugins, that’s when I started to really get into programming. I’ve been able to heavily apply everything that I’m interested in on all of my projects.",
      "image": "/img/BenBreidenthal.jpg",
      "link": "https://www.youtube.com/watch?v=sph31UwzNIY"
    },
    {
      "name": "Julian D’Angelo",
      "class": "2016",
      "quote":"I chose Bioinformatics because it’s extremely multidisciplinary. I also chose the major because of the inevitability of importance of computational skills and programming, because that’s where science fields in general are going.",
      "image": "/img/JulianDAngelo.jpg",
      "link": "https://www.youtube.com/watch?v=RxAmu_XOtfA"

    },
    {
      "name": "Rachel Kim",
      "class": "2016",
      "quote":"When I applied for college, I applied to be in the psychology department. I changed to Cognitive Science because people told me it goes outside studies of just the brain. All of my classes before my sophomore year were about the brain and the body. When we took a class that was more of a group project, where we had to design an app, it made me feel like: ‘This is my field!’ because I love interacting with people.",
      "image": "/img/RachelKim.jpg",
      "link": "https://www.youtube.com/watch?v=uua-4Cxs5Ss"
    },
    {

      "name": "Chyheim Jackson-Burgess",
      "class": "2016",
      "role": "Google - YouTube Gaming",
      "quote":"As a child I was really interested in video games, so I ran around my local high school to find opportunities to develop video games. I found this summer camp, where we created small video game projects and I learned C# there. After that, I did a summer program at Google called the Computer Science Summer Institute and there I learned about Python, Javascript, and HTML. Ever since then, I have been interested in Computer Science.",
      "image": "/img/ChyheimJackson-Burgess.jpg",
      "link": "https://www.youtube.com/watch?v=J7bCiz77pRw"
    },
    {
      "name": "Sam Payne",
      "role": "Associate Professor at BYU",
      "quote":"When I was an undergraduate degree in 2000, my sister recognized my interest in biology and skill set in computer science and told me that there was an emerging field called bioinformatics, but that there were no degrees for it yet. This led me to choose courses in my undergraduate degree that would prepare me to be a bioinformatics researcher.",
      "image": "/img/SamPayne.jpg",
      "link": "https://www.youtube.com/watch?v=BZhqgHJkTxk"
    },
    {
      "name": "Terry Zhou",
      "class": "2018",
      "quote":"I had a robot project in high school… That was the first time I programmed software that applied to hardware. You can see how the robot moves and you have to program how it moves instead of focusing on purely software or hardware. That’s when I realized that Computer Engineering is more interesting than pure CS or EE.  If you’re interested in EE, switch into an EE major. If you’re interested in CS, switch to a CS major. If you’re not sure and you like both, you should do CE.",
      "image": "/img/TerryZhou.jpg",
      "link": "https://www.youtube.com/watch?v=KFRKsQoiU18"
    },
    {
      "name": "Hannah Chou",
      "class": "2015",
      "quote":"When I was in undergrad, I was choosing between physiological sciences and electrical engineering. I’ve realized that you can do electrical engineering with a lot of different fields. That’s why I’m interested in medical devices. You still get human interaction with medical devices in electrical engineering.",
      "link": false
    },
    {
      "name": "Davis Liang",
      "class": "2016",
      "quote":"Electrical Engineering is very, very hard. It is not for the faint hearted. However, it is very rewarding in that you learn a lot of things that are extendable into other fields of study. For example, if you pick another major, you will not learn about things such as fourier transforms, signal convolution, and how computers work on the hardware level.",
      "link": false

    }
  ],
  "majors": [
    {
      "name": "Bioinformatics",
      "cap": true,
      "degree": "bs",
      "departments": [
        "bsc",
        "cse",
        "bie"
      ],
      "hook": "Bioinformatics majors address the growing need for trained computational biologists in the rapidly growing field of biological data analysis.",
      "moreInfo": [
        {
          "name": "Major Website",
          "link": "https://biology.ucsd.edu/education/undergrad/maj-min/majors/index.html"
        }
      ],
      "image": "/img/Bioinformatics.jpg",
      "short": "bio"
    },
    {
      "name": "Cognitive Science",
      "cap": false,
      "degree": "bs",
      "departments": [
        "cog"
      ],
      "hook": "Cognitive Science students are at the forefront of researching solutions and developing technology designed to better suit humanity.",
      "moreInfo": [
        {
          "name": "Major Website",
          "link": "http://www.cogsci.ucsd.edu/undergraduates/major/index.html"
        }
      ],
      "image": "/img/CognitiveScience.jpg",
      "short": "cog"
    },
    {
      "name": "Computer Science",
      "cap": true,
      "degree": "bs",
      "departments": [
        "cse"
      ],
      "hook": "Computer science students gain knowledge in key computing theories and languages, directly preparing them to enter high tech industry.",
      "moreInfo": [
        {
          "name": "Major Website",
          "link": "https://cse.ucsd.edu/"
        }
      ],
      "image": "/img/ComputerScience.jpg",
      "short": "cse"
    },
    {
      "name": "Electrical & Computer Engineering",
      "cap": true,
      "degree": "bs",
      "departments": [
        "cse",
        "ece"
      ],
      "hook": "Electrical and Computer Engineering students unite principles of mathematics and science to become architects of electronic systems.",
      "moreInfo": [
        {
          "name": "Major Website",
          "link": "http://www.ece.ucsd.edu/"
        }
      ],
      "image": "/img/ElectricalEngineering.jpg",
      "short": "ece",
      "note": "The Computer Engineering major is offered by both the CSE and ECE departments. Despite the major cap status, students within this major are able to switch into other majors within their respective departments such as pure Computer Science (CSE) or pure Electrical Engineering (ECE)."
    },
    {
      "name": "Mathematics–Computer Science",
      "cap": true,
      "degree": "bs",
      "departments": [
        "mat"
      ],
      "hook": "Mathematics–Computer Science students focus on the intersection between mathematics and theoretical computer science.",
      "moreInfo": [
        {
          "name": "Major Website",
          "link": "https://math.ucsd.edu/"
        }
      ],
      "image": "/img/Math-CS.jpg",
      "short": "mcs"
    },
    {
      "name": "Scientific Computation",
      "cap": true,
      "degree": "bs",
      "departments": [
        "mat",
        "phy",
        "cse"
      ],
      "hook": "Scientific Computation majors bridge the gap between applied mathematics, physics, and computer science.",
      "moreInfo": [
        {
          "name": "Math Department",
          "link": "https://math.ucsd.edu/"
        },
        {
          "name": "Physics Department",
          "link": "https://physics.ucsd.edu/"
        }
      ],
      "image": "/img/SciComp.jpg",
      "short": "sci"
    },
    {
      "name": "Interdisciplinary Computing and the Arts",
      "cap": false,
      "degree": "ba",
      "departments": [
        "vis",
        "mus"
      ],
      "hook": "Interdisciplinary Computing and the Arts students embody the new generation of artists and musicians.",
      "moreInfo": [
        {
          "name": "Music ICAM",
          "link": "http://musicweb.ucsd.edu/ugrad/ugrad-pages.php?i=103"
        },
        {
          "name": "Visual Arts ICAM",
          "link": "https://visarts.ucsd.edu/undergrad/major-req/icam.html"
        }
      ],
      "image": "/img/ICAM.jpg",
      "short": "ica",
      "note": "Applicants may be asked to submit an optional supplemental application and/or portfolio/audition for faculty review."
    },
    {
      "name": "Speculative Design",
      "cap": false,
      "degree": "ba",
      "departments": [
        "vis"
      ],
      "hook": "Speculative Design is a 21st century mix of art, science, and emerging technology focused on aesthetic and entrepreneurial and activist intervention.",
      "moreInfo": [
        {
          "name": "Major Website",
          "link": "https://visarts.ucsd.edu/undergrad/major-req/spec-design.html"
        }
      ],
      "image": "/img/SpecDesign.jpg",
      "short": "spc"
    },
    {
      "name": "Data Science",
      "cap": true,
      "degree": "bs",
      "departments": [
        "cse",
        "cog",
        "mat"
      ],
      "hook": "Data scientists use mathematics and computing to tackle the emerging need for data analysis in a wide range of industries.",
      "moreInfo": [
        {
          "name": "Major Website",
          "link": "https://datascience.ucsd.edu/academics/undergraduate/index.html"
        }
      ],
      "image": "/img/DataScience.jpg",
      "short": "dat"
    }
  ],
  "departments": {
    "bsc": {
      "name": "Biological Sciences",
      "link": "https://biology.ucsd.edu/"
    },
    "bie": {
      "name": "Bioengineering",
      "link": "http://be.ucsd.edu/"
    },
    "cog": {
      "name": "Cognitive Sciences",
      "link": "http://www.cogsci.ucsd.edu/"
    },
    "cse": {
      "name": "Computer Science",
      "link": "https://cse.ucsd.edu/"
    },
    "ece": {
      "name": "Electrical Engineering",
      "link": "http://www.ece.ucsd.edu/"
    },
    "mat": {
      "name": "Mathematics",
      "link": "https://math.ucsd.edu/"
    },
    "phy": {
      "name": "Physics",
      "link": "https://physics.ucsd.edu/"
    },
    "vis": {
      "name": "Visual Arts",
      "link": "http://visarts.ucsd.edu/"
    },
    "mus": {
      "name": "Music",
      "link": "http://musicweb.ucsd.edu/"
    }
  },
  "majorDescriptions": {
    "bio": "The Bioinformatics major offers rigorous, interdisciplinary training in the rapidly growing and evolving field of bioinformatics within the Division of Biological Sciences. Bioinformatics uses computational approaches to analyze biological data (e.g., large scale genomic, proteomic, and metabolomic datasets) to investigate living organisms and their communities. An understanding of the qualitative and quantitative biological data that are accruing, and the tools used to analyze them, requires substantial mastery of biology, chemistry, mathematics, physics, and computer science. The interdisciplinary bioinformatics specialization will be offered by two other departments (computer science and engineering and bioengineering). All three versions of the bioinformatics specialization share a common set of core requirements, and also have distinct requirements reflecting each unit’s academic focus.",
    "cog": "The Cognitive Science major is an interdisciplinary and diverse field that blends the understanding of the brain, human behavior, and computation. Students can choose to explore specializations that span a wide breadth of disciplines including: neural/biological sciences, computational sciences, machine learning, cognitive modeling, cognitive/machine perception, computational neuroscience, social sciences, and design.  Graduates of this program often go on to graduate school or work in research, UX and product design, and data analysis.",
    "cse": "The Computer Science major allows students to initially explore computer science through algorithmic problem solving and programming in various languages, including Java and C. Students then progress to topics involving a deeper understanding of computer systems including advanced data structures and computer architecture. Additional elective courses provide depth into systems and networks, database analysis, security and cryptography topics, machine learning, computer vision, and graphics.<br> Many graduates of this program go on to graduate school or choose careers that involve machine automation, UI/UX design, data analytics, application development, artificial intelligence, networking, and security.",
    "ece": "Both Computer Engineering and Electrical Engineering involve understanding of electricity, electronics, and electromagnetism in addition to computational knowledge. Students can choose to have more of a balance between software and hardware as computer engineers or a greater emphasis on hardware as electrical engineers.",
    "mcs": "The Mathematics–Computer Science major is a specialized branch of mathematics, providing a focus on computer science. While not covering the same scope as a pure Computer Science major, Math-CS prepares students to potentially work in a computing setting. Students are given flexibility in their course subjects, allowing the opportunity to have a greater focus on mathematics or to take a more even distribution of courses in mathematics and computer science. Students study subjects including abstract algebra, statistics and probability, combinatorics, algorithm analysis, programming, and data structures.",
    "sci": "Scientific Computation is a grouping of two separate majors offered by the mathematics and physics departments, in conjunction with the computer science department. Both majors focus on the intersection of their respective fields and computing.",
    "ica": "The Interdisciplinary Computing and the Arts major (ICAM) is an exciting blend of computer science, art, and technology that explores today’s cutting-edge media. Access to a wide range of disciplines means that students are free to tailor the program to their artistic interests, and can take classes in fields like virtual reality, design communication, film production, and physical electronics programming. ICAM students gain technical, theoretical, and historical backgrounds that prepare them to anticipate and work with emerging trends in art, music, and technology. They can choose from either music technology or visual arts focuses, which influence their upper-level coursework, but often draw from both fields during their journey through the major.",
    "spc": "The Speculative Design major mixes art, science, and emerging technology, with a focus on aesthetics, entrepreneurship, and activist intervention. Combining laboratory and field research in a creative studio setting, Speculative Design works from nano to urban scales to stimulate new ideas and innovative solutions. Rather than focusing on existing methodologies, this program prepares students to solve problems that will emerge in an uncertain future. Students may choose from four areas of emphasis: Public Culture and Urban Ecology, Design Computing, Design Research, and Media Design.",
    "dat": "Data science majors use mathematical models and computational methods to craft powerful data analysis and meet the emerging needs of data-driven industries, from manufacturing companies to government organizations. The core knowledge base of the data scientist lies at the intersection of computing and mathematics, coupled with the skills to abstract, build, and test predictive and descriptive models. Students in the program can expect coursework in mathematics, computer science, and statistics, as well as foundational lower division coursework in natural and physical sciences."
  },
  "majorExpand": {
    "bio": {
      "type": "SPECIALIZATIONS",
      "data": [
        {
          "name": "Biology - Bioinformatics",
          "detail": "The Biology - The bioinformatics specialization offered by the Division of Biological Sciences is aimed at a student interested in applying, and to some extent developing, tools of bioinformatics for the study of biological systems. Students will receive a Bachelor of Science degree in biology with a specialization in bioinformatics. This degree will prepare students for graduate studies in biological and biomedical sciences, and provide excellent training for work in the biomedical, pharmaceutical, biotechnology, and bioinformatics industries."
        },
        {
          "name": "Computer Science - Bioinformatics",
          "detail": "The Computer Science - Bioinformatics major applies computer science and mathematics to model the flow of information in biological systems and uses computational and experimental methods to develop an integrated understanding of living organisms. Many graduates in this degree go on to graduate school, medical school, or choose careers involved in computational molecular biology, bioinformatics, proteomics, approximation algorithms, human genome, and protein identification."
        },
        {
          "name": "Bioengineering - Bioinformatics",
          "detail": "The Bioengineering - Bioinformatics major explores the flow of information in living systems. This major emphasizes systems engineering, model-based approaches, and computer science to understanding bioinformatics data. This degree will provide a heightened understanding of cellular functions, protein structure and design, evolutionary biology, regulatory networks, the molecular basis of disease, the generation of novel therapeutics, and customized proteins. Graduates of this program often go on to work in fields of molecular biology and systems engineering analysis."
        },
        {
          "name": "Chemistry - Bioinformatics",
          "detail": "The Chemistry - Bioinformatics major accounts for an evolving field of qualitative and quantitative data by developing an understanding of systems properties of model organisms. This major is aimed at students interested in applying and developing tools of bioinformatics for the study of chemical processes in biological systems. Students can expect to tackle classes in computer science, mathematics, biology, and physics, with a strong emphasis on biochemistry and chemistry courses."
        }
      ]
    },
    "cog": {
      "type": "SPECIALIZATIONS",
      "data": [
        {
          "name": "Neuroscience",
          "detail": "Neuroscience is intended for majors interested in neuroscience research or medicine. Elective coursework includes cognitive neuroscience, organic chemistry, biochemistry, and physiology."
        },
        {
          "name": "Clinical Aspects of Cognition",
          "detail": "Clinical Aspects of Cognition is intended for majors interested in cognitive neuropsychology, psychiatry, cognitive disorders, and the effects of drugs and brain-damage on cognitive functions. Allowed elective coursework includes organic chemistry, biochemistry, and physiology."
        },
        {
          "name": "Design and Interaction",
          "detail": "Design and Interaction is intended for majors interested in human computer interaction, web design, visualization, and applications of cognitive science in design and engineering. Elective coursework includes  cognitive science, computer science, computer engineering, and visual arts."
        },
        {
          "name": "Language, Culture, and Cognition",
          "detail": "Language, Culture, and Cognition is intended for majors whose primary interests include human psychology and applications of cognitive science in design and engineering. Elective coursework includes cognitive development, language, laboratory research of cognition, anthropology, and sociology."
        },
        {
          "name": "Machine Learning and Neural Computation",
          "detail": "Machine Learning and Neural Computation is intended for majors interested in computational and mathematical approaches to modeling cognition or building cognitive systems, theoretical neuroscience, as well as software engineering and data science. Elective coursework includes neural networks, artificial intelligence, and computer science."
        }
      ]
    },
    "ece": {
      "type": "SPECIALIZATIONS",
      "data": [
        {
          "name": "Computer Engineering",
          "detail": "The Computer Engineering major is a unique blend of hardware and software allowing students to explore both the computer science and electrical engineering disciplines. Students obtain a range of knowledge from circuitry and programming to the design and analysis of computer architecture and electronic systems. Computer engineering students begin with core courses in both the CSE and ECE departments, but go on to take advanced elective courses to specialize in one, or both fields.<br>Many graduates in this degree program go on to graduate school or choose careers that involve the design of computer hardware and software systems in diverse areas such as computer graphics, computer-aided design, multimedia systems, databases, parallel computation, distributed computation, artificial intelligence, optical computing, and fabrication."
        },
        {
          "name": "Electrical Engineering",
          "detail": "Electrical Engineering is a flexible, broad, and powerful major that equips students for professions in engineering, medicine, law, and business administration. Students first go through a common lower-division series where they take courses in mathematics, physics, chemistry, and electrical and computer engineering, and then a flexible series of upper-division courses in topics like communication systems, machine learning, and signal and image processing.  Graduates have found high tech positions in diverse areas such as computer electronics, phone and satellite communication systems, advanced circuit and optical systems design, and wireless communications."
        }
      ]
    },
    "sci": {
      "type": "SPECIALIZATIONS",
      "data": [
        {
          "name": "Mathematics - Scientific Computation",
          "detail": "The Mathematics - Scientific Computation major is a specialized branch of applied mathematics, utilizing computation to solve complicated numerical problems that apply to real world situations. This major emphasizes material most relevant to numerical simulation and scientific computation. Students are given an introduction to programming, and gain opportunities to utilize various methods in applied science and mathematics including approximation, software design, and scientific visualization. Students study subjects including linear algebra, statistics, numerical analysis, and optimization."
        },
        {
          "name": "Physics – Computational Physics",
          "detail": "The Physics – Computational Physics major is a specialized branch of applied physics,  exploring the intersection between physics and computing. Students enjoy access to major-restricted computer science, mathematics, and physics electives in topics like information technology, engineering application development, and high tech instrumentation. Students also gain a wealth of knowledge in several principal areas of physics and work with physics faculty to design an optimal career development track in the flexible curriculum. This major prepares students to enter the information technology and high tech industry workforce or to pursue graduate work in computational science or computational physics."
        }
      ]
    }
  },
  "resources": [
    {
      "name": "Applied Physics and Mathematics Building",
      "description": "Located between Thurgood Marshall and John Muir College, the Applied Physics and Mathematics Building (APM) is a facility which houses research, offices, classrooms, meeting rooms, and other resources for students.",
      "mapImage": "img/APMBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=165070",
      "link": "https://www.math.ucsd.edu/",
      "tags": [
        "as",
        "bs",
        "ws"
      ]
    },
    {
      "name": "Atkinson Hall Facilities",
      "description": "Atkinson Hall includes many unique spaces that can meet the needs of almost any meeting, conference, or event. As the Qualcomm Institute’s headquarters, the 250,000sf building is a technologically advanced facility specializing in cutting-edge applications of technology and communication needs.",
      "mapImage": "img/AtkinsonBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163038",
      "link": "http://qi.ucsd.edu/facilities.php",
      "tags": [
        "bs",
        "ws"
      ]
    },
    {
      "name": "Content Tutoring",
      "description": "The Teaching + Learning Commons is the foundation for achieving the university’s goal to be a student-centered university. Its programs and services create a contiguous, multi-layered network of support that jointly enhance learning and increase academic success. Specifically, The Commons: Advances teaching excellence and student academic success; Analyzes and tracks students’ academic success and assesses student and instructional success initiatives; Increases access to education on campus and beyond; Drop-in tutoring is available for Math, Physics, and Chemistry. Tutors will assist students on a first-come/first-helped basis.",
      "mapImage": "img/GeiselLib.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163025",
      "link": "http://commons.ucsd.edu/students/math-chemistry-tutoring/",
      "tags": [
        "as",
        "sc"
      ]
    },
    {
      "name": "Computer Music Instructional Laboratory",
      "description": "Located in the Conrad Prebys Music Center, The Computer Music Instructional Laboratory resides in a new 500-square-foot studio with machine isolation, acoustical treatment, mixer console, ergonomic workstation components, a high-resolution plasma screen, CD and DVD authoring, and integrated digital audio equipment for student access to audio processing, duplicating, high definition digital mixing and high-quality, multi-channel audio monitoring. The studio is built around a Yamaha DM2000 mixing console which is the central connection point for all digital and analog audio signals. The facility provides adequate space for instrumental rehearsal and interfacing experimentation and provides several firewire and USB audio interfaces for laptop computing.",
      "mapImage": "img/CPMCBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=186265",
      "link": "http://musicweb.ucsd.edu/about/about-pages.php?i=403#B104",
      "tags": [
        "as",
        "ws"
      ]
    },
    {
      "name": "The Computer Science Channel",
      "description": "Showcasing the excellence and diversity of the nation's premier research university, UCTV embraces the core missions of the University of California -- teaching, research and public service -- through quality, in-depth television that informs, educates and enriches the lives of people around the globe.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "http://www.uctv.tv/computer-science/search-details.aspx?showID=31158",
      "tags": [
        "as",
        "eq"
      ]
    },
    {
      "name": "Computer Science and Engineering Building",
      "description": "Located along the Warren Mall, The Computer Science and Engineering building was designed to create a sense of community among the department's faculty, staff, students, and visitors. \"Interaction spaces\" for scholarly activity are located throughout the building where graduate and undergraduate students can drop in to discuss classroom topics, share research ideas, or hold casual conversations. The building houses laboratories dedicated to undergraduate instruction, as well as research facilities designed for ultimate flexibility so faculty and researchers can work on the technologies of the future.",
      "mapImage": "img/CSEBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163049",
      "link": "https://cse.ucsd.edu/about/our-building",
      "tags": [
        "as",
        "ws"
      ]
    },
    {
      "name": "Conrad Prebys Music Center",
      "description": "Located near Pepper Canyon Hall and the Gilman Parking Structure, the Conrad Prebys Music Center (CPMC) is a facility which houses the university's music department. The center features a 400-seat Concert Hall, in addition to the 170-seat Recital Hall and an Experimental Theatre with variable digital acoustics system.",
      "mapImage": "img/CPMCBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=186265",
      "link": "http://musicweb.ucsd.edu/about/about-pages.php?i=441",
      "tags": [
        "bs",
        "ws"
      ]
    },
    {
      "name": "CSE Basement",
      "description": "Located at the bottom floor of the Computer Science building, the Basement, commonly known as “the dungeon”, is a space with computer workstations for students to work on CSE-related assignments. Depending on the course, tutoring is available at specific hours.",
      "mapImage": "img/CSEBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163049",
      "link": "https://cse.ucsd.edu/about/computer-science-and-engineering-building-ebu3b",
      "tags": [
        "as",
        "ws"
      ]
    },
    {
      "name": "CSES: Late Night Hacks",
      "description": "Late Night Hacks is a procedural epistemology project group at UCSD, part of CSES. They work on various projects, and host talks on various subjects. Kind of like a CSE Town Hall meeting, once a week. Come hang out, share knowledge, and get involved. ",
      "mapImage": "img/CSEBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163049",
      "link": "https://cses.ucsd.edu/late-night/",
      "tags": [
        "ev",
        "ws"
      ]
    },
    {
      "name": "The Design Lab",
      "description": "Located in the California Institute of Telecommunication and Information Technology (Calit2) Building, The Design Lab is a newly established organization, proposing a novel mix of the practice and theory of thinking, observing, and making. The Design Lab is located within the California Institute of Telecommunication and Information Technology.",
      "mapImage": "img/AtkinsonBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163038",
      "link": "http://designlab.ucsd.edu/",
      "tags": [
        "ws"
      ]
    },
    {
      "name": "DevFair by CSES",
      "description": "Occurring every year during the Fall, DevFair takes the traditional career fair and spins it on its head. Rather than having companies set up booths that students can visit, they allow groups of students set up booths to showcase their projects to recruiters. This science fair-style presentation gives students the opportunity to show their potential better than a resume ever could. The event is geared towards UCSD undergraduate students in a tech-related field.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "https://cses.ucsd.edu/devfair/",
      "tags": [
        "ev",
        "cr"
      ]
    },
    {
      "name": "Digital Media Lab",
      "description": "Geisel Library's Digital Media Lab (DML) is open to all UCSD faculty, staff, and students, providing a space for media creation and editing. It is located in the Geisel East Commons, on the 2nd floor. Specific capabilities include free 3D printing, video editing (e.g., Final Cut, iMovie, Camtasia), image manipulation (e.g., Photoshop, Illustrator, After Effects), sound editing (e.g., Adobe Audition, Garageband), media-rich website creation (e.g., Dreamweaver, Flash, Filezilla), and basic productivity (e.g., MS Office, web browsers, Adobe Acrobat Pro). The DML is now offering support for app development, with Unity, Android Studio, and Steam enabled on all Windows workstations.",
      "mapImage": "img/GeiselLib.jpg",
      "mapLink": "https://maps.ucsd.edu/map/Default.htm?id=1005&mrkIid=163049",
      "link": "https://library.ucsd.edu/computing-and-technology/digital-media-lab/index.html",
      "tags": [
        "eq",
        "ws"
      ]
    },
    {
      "name": "Digital Music Recording Studio",
      "description": "Located in the Conrad Prebys Music Center, this 1500-square-foot facility includes an acoustically designed live room with high ceilings, a wooden floor, and a control room with Genelec 5.1 surround monitoring. The studio houses a Macintosh system and many dedicated software packages for music production and recording, including a ProTools HD digital audio production package with 24 channels of digital I/O for precise digital recording and editing with Apogee converters and Grace Design microphone preamps. The studio supports MIDI for synthesis, processing, and control in music composition and performance, and includes hardware and software for CD and DVD mastering.",
      "mapImage": "img/CPMCBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163025",
      "link": "http://musicweb.ucsd.edu/about/about-pages.php?i=403#B108",
      "tags": [
        "ws"
      ]
    },
    {
      "name": "Disciplines in Engineering Career Fair (DECaF)",
      "description": "This event provides company representatives a unique opportunity to interact and engage with UC San Diego's talented engineering students regarding career options, internships, and permanent or summer employment opportunities. Open exclusively to UC San Diego students and alumni, DECaF is coordinated by the Triton Engineering Student Council and over 40 pre-professional engineering student organizations at the Jacobs School of Engineering. These engineering societies, representing the spectrum of disciplines at the Jacobs School, work in close collaboration to maximize the attendance of UC San Diego's 8,500 undergraduate and graduate student engineers and to ensure the satisfaction of companies involved.",
      "mapImage": "img/PriceCenter.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=166926",
      "link": "http://tesc.ucsd.edu/decaf/",
      "tags": [
        "bs",
        "ws",
        "cr"
      ]
    },
    {
      "name": "Electrical Engineering Student Tutoring",
      "description": "Electrical Engineering tutoring sessions are available in Jacobs Hall (EBUI) 5101 on a daily basis. Walk-ins are welcome for students in the following courses: ECE 15-103, ECE 153 and ECE 174.",
      "mapImage": "img/JacobsBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163125",
      "link": "http://www.ece.ucsd.edu/undergraduate/ece-tutoring",
      "tags": [
        "as"
      ]
    },
    {
      "name": "Envision Maker Studio",
      "description": "Located in the Structural Materials and Engineering Building (SME 306), The EnVision Arts and Engineering Maker Studio at is a hands-on, experiential education facility where visual arts and engineering communities converge. The nearly 3,000 square foot studio provides a wide range of design, fabrication and prototyping tools, both analog and digital. Resources include workstations with CAD and Adobe CC software installed, 3d Printers, soldering stations, a laser cutter, and a vacuum former. The studio is accessible for Engineering or Visual Arts majors, and students enrolled in courses currently offered within the studio. 1",
      "mapImage": "/img/sme.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163174",
      "link": "http://jacobsschool.ucsd.edu/envision/",
      "tags": [
        "ws"
      ]
    },
    {
      "name": "Gallery @ Calit2",
      "description": "Located in Atkinson Hall, Gallery@Calit2 reflects the nexus of innovation implicit in Calit2's vision, and aims to advance our understanding and appreciation of the dynamic interplay among art, science and technology. Calit2 is a partnership between UC San Diego and UC Irvine, and houses over 1,000 researchers organized around more than 50 projects on the future of telecommunications and information technology and how these technologies will transform a range of applications important to the economy and citizens' quality of life.",
      "mapImage": "img/AtkinsonBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163038",
      "link": "http://gallery.calit2.net/portal/",
      "tags": [
        "sc"
      ]
    },
    {
      "name": "Geisel Library",
      "description": "Great Research Starts Here. Ranked among the nation's top 25 public academic libraries, Geisel Library plays a critical role in advancing and supporting UC San Diego.",
      "mapImage": "img/GeiselLib.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163025",
      "link": "http://libraries.ucsd.edu/",
      "tags": [
        "bs",
        "ws"
      ]
    },
    {
      "name": "Gordon Leadership Center",
      "description": "Located in the Powell-Focht Bioengineering Hall, the Gordon Engineering Center aims to identify and train effective engineering leaders who will create jobs and products that benefit society. This is accomplished through a series of workshops, courses and engineering leadership forums for undergraduate and graduate students at UC San Diego, as well as local professionals and high school students who aspire to become engineers.",
      "mapImage": "img/BioBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163125",
      "link": "http://jacobsschool.ucsd.edu/GordonCenter/",
      "tags": [
        "as"
      ]
    },
    {
      "name": "HackXX",
      "description": "HackXX is UC San Diego's women's hackathon and an empowering place to build great projects. Over 24 hours, women will be given the tools and knowledge to materialize their technological dreams. They will be able to form strong bonds by collaborating with other women in tech, interacting with the the CS community, and engaging with industry representatives from top companies.",
      "mapImage": "img/JacobsBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163125",
      "link": "http://hackxx.sdhacks.io/",
      "tags": [
        "ev",
        "ws"
      ]
    },
    {
      "name": "HandShake",
      "description": "A career services platform that connects students and employers to democratize the job finding experience in college and beyond.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "https://ucsd.joinhandshake.com/",
      "tags": [
        "ev",
        "sc",
        "cr"
      ]
    },
    {
      "name": "H.A.R.D. Hack",
      "description": "Hash out. Analyze. Research. Design. All core steps of overcoming engineering challenges. The HARD Hack is a 24 hour hardware centered hackathon hosted by IEEE and HKN.",
      "mapImage": "img/JacobsBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163125",
      "link": "http://www.ece.ucsd.edu/events/hkn-ieee-h-a-r-d-hack",
      "tags": [
        "ev",
        "ws"
      ]
    },
    {
      "name": "ICAM Project Studios",
      "description": "Located in the Conrad Prebys Music Center, these four 200-square-foot studios are designed for individual work on computer music projects. Each studio is equipped with an eight-channel DAW (iMac with MOTU audio interface) and is acoustically treated. In addition, the four studios are designed with different orientations: one with equipment, monitoring and software to support video editing; one for recording, editing and mastering; one for work with MIDI synthesizers; and one with analog mixing and recording.",
      "mapImage": "img/CPMCBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=186265",
      "link": "http://musicweb.ucsd.edu/about/about-pages.php?i=403#icam",
      "tags": [
        "ws"
      ]
    },
    {
      "name": "IDEA Learning Center",
      "description": "The IDEA Learning Center, located at Jacobs Hall B805, is a space for all of the Engineering Learning Communities. Engineering Learning Communities are the formation of formal study groups that bring engineering students into a supportive environment where they can develop confidence, strengthen study skills, and learn the value of collaborative study. This small class environment seeks to increase student mastery and motivation by eliminating the intimidating large classes that engineering students experience particularly in the freshman year.",
      "mapImage": "img/JacobsBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163125",
      "link": "http://jacobsschool.ucsd.edu/idea/resources/idea_studylab.shtml",
      "tags": [
        "as",
        "ws"
      ]
    },
    {
      "name": "IDEA Freshman Summer Engineering Institute",
      "description": "Get a jump start on your academic career at UC San Diego's 5-week, residential Summer Engineering Institute (SEI), and earn six credits towards your engineering degree. Receive support in making the transition from high school to the rigors of a university-level engineering curriculum, and build awareness of relevant campus programs and resources. Take part in organized social activities on evenings and weekends, and begin forming a peer network and make lasting friendships.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "http://jacobsschool.ucsd.edu/idea/programs/freshman_summer_institute.shtml",
      "tags": [
        "as",
        "ev"
      ]
    },
    {
      "name": "IDEA Transfer PrEP",
      "description": "Transfer PrEP is a 3-day, 2-night program held over the summer for incoming transfer engineering students. This free program provides incoming students with the opportunity to become acclimated to campus life, build skills and habits necessary for success in engineering, and develop community amongst their peers before beginning their courses in the fall. Participants will live on campus throughout the duration of the program in residential halls with current undergraduate transfer students majoring in engineering as PrEP Leaders who will serve as their peer leaders and mentors throughout the duration of the program.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "http://jacobsschool.ucsd.edu/idea/programs/summer_prep.shtml",
      "tags": [
        "as",
        "ev"
      ]
    },
    {
      "name": "Instructional Computing Laboratory",
      "description": "Located in the Conrad Prebys Music Center, the 600-square-foot Instructional Computing Lab features 10 Intel iMac workstations and laptop work area. The composition work surfaces are based around Akai keyboard controllers. Software includes Ableton Live Suite 9, Max/MSP/Jitter 7, Soundhack, Pure Data, Sibelius 8, LogicX, and Adobe CS.",
      "mapImage": "img/CPMCBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=186265",
      "link": "http://musicweb.ucsd.edu/about/about-pages.php?i=403#B104",
      "tags": [
        "as",
        "ws"
      ]
    },
    {
      "name": "Kamil Gallery",
      "description": "Located in the lower level of the Mandeville Center, The Adam D. Kamil Art Gallery is a resource for Visual Arts students to view and exhibit art projects. Opportunities to exhibit work are offered on a quarterly basis.",
      "mapImage": "img/MandevilleBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=229230",
      "link": "https://visarts.ucsd.edu/about/facilities.html",
      "tags": [
        "sc"
      ]
    },
    {
      "name": "Mandeville",
      "description": " The Mandeville Center houses visual arts class and conference rooms, staff offices, student advising, computer lab, digital photography lab, the Adam D. Kamil Gallery, the undergraduate wood and metal shop, as well as the University Art Gallery.",
      "mapImage": "img/MandevilleBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=229230",
      "link": "http://mandeville.ucsd.edu/",
      "tags": [
        "bd",
        "ws",
        "as",
        "ga"
      ]
    },
    {
      "name": "Media Teaching Lab",
      "description": "Located in the Communications Building, the Media Teaching Lab offers outstanding media facilities, equipment, and technical assistance provided to students and faculty. The facility offers rental services for equipment and workshops to learn software, photography work, and lighting. The Media Teaching Lab's aim is to facilitate students in making the highest quality videos and films with excellent sound, editing, and cinematography. The space also holds regular workshops and events to educate students in editing, HD workflow, cameras, and lighting all throughout the quarter.",
      "mapImage": "img/CommBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163048",
      "link": "http://acms.ucsd.edu/students/medialab/",
      "tags": [
        "as",
        "eq",
        "ev"
      ]
    },
    {
      "name": "OASIS Math and Science",
      "description": "OASIS math and science workshops are structured group-learning study-sessions led by a tutor who explains course concepts and encourages a collaborative learning environment. Each workshop session is 2 hours and meets twice a week",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "https://students.ucsd.edu/sponsor/oasis/math-science/index.html",
      "tags": [
        "as",
        "ws"
      ]
    },
    {
      "name": "OASIS Summer Bridge",
      "description": "A year-long transition program for incoming freshman students that begins with an intensive 5 week residential & academic component in August. Summer Bridge continues throughout the academic year, providing academic & personal support throughout your first year at UC San Diego.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "https://oasis.ucsd.edu/programs/summer-bridge/index.html",
      "tags": [
        "as",
        "ev"
      ]
    },
    {
      "name": "OASIS TRIO Student Support Services Program & Summer Experience",
      "description": "A year-long transition program for incoming freshman students that begins with an intensive 5 week residential & academic component in August. Summer Bridge continues throughout the academic year, providing academic & personal support throughout your first year at UC San Diego.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "https://oasis.ucsd.edu/programs/trio/index.html",
      "tags": [
        "as",
        "ev"
      ]
    },
    {
      "name": "OASIS - 2Excel",
      "description": "2Excel is a retention program serving second-year students. The program is a year-long commitment starting Fall through Spring quarter.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "https://oasis.ucsd.edu/programs/2nd-year/index.html",
      "tags": [
        "as"
      ]
    },
    {
      "name": "OASIS Guardian Scholars Program",
      "description": "The Guardian Scholars Program (GSP) is committed to supporting current and former foster youth at UCSD through a variety of holistic services that aid the students in achieving a college degree. The GSP understands that there are many hardships that foster youth endure and strives to be a resource and advocate for all its students.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "https://students.ucsd.edu/finances/financial-aid/types/scholarships/guardian.html",
      "tags": [
        "as"
      ]
    },
    {
      "name": "SD Hacks",
      "description": "SD Hacks is About... Empowerment: They provide all hackers with expertise, hardware and software so they can build their dreams. Collaboration: They’re all here as fellow mentors, 4am-ers, and friends. Innovation: They strive to make each SD Hacks a memorable learning experience for all.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "https://www.sdhacks.io/",
      "tags": [
        "ev",
        "ws"
      ]
    },
    {
      "name": "SPIS",
      "description": "SPIS is a 5-week residential summer program on the UC San Diego campus for students accepted into CSE majors as well as for other UCSD admitted students who want to explore computer science as a career option. SPIS courses are taught by the very best faculty at UCSD. Students in the program interact with a wide range of CSE faculty and learn about computer science and engineering research. They also have opportunities to connect with engineers from the computer industry. SPIS provides an excellent student experience with individual meetings with faculty, tutoring from experienced CSE undergraduate students, collaborations with fellow students, individual advising to smooth the transition to UCSD, and living on campus.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "https://sites.google.com/a/eng.ucsd.edu/spis/",
      "tags": [
        "as",
        "ev"
      ]
    },
    {
      "name": "Structural & Material Engineering Building",
      "description": "Located on the corner of Voigt Drive and Matthews Lane near Sixth College, the 183,000 square foot building houses a community of artists and engineers which includes 12 visual arts studios, a gallery and performance space, and 11 distinct visual arts research initiatives, and a state of the art paint booth. The building is also home to an array 160 graduate student, faculty, and staff offices and the EnVision makerspace.",
      "mapImage": "img/sme.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163174",
      "link": "http://jacobsschool.ucsd.edu/sme/",
      "tags": [
        "bs",
        "ws"
      ]
    },
    {
      "name": "Teaching + Learning Commons",
      "description": "In 2015, UC San Diego established the Teaching + Learning Commons to advance and improve how we teach and learn. Today, a suite of services and programs are in place to develop better instructors and more engaged learners. Our campus is committed to delivering an educational experience that prepares students who are capable of solving problems, leading, and innovating in a diverse and interconnected world. Tutoring is available for Math 2, 3C, 4C, 10A, 10B, 10C, 20A, 20B, and 20C as well as Chemistry 6A, 6B, and 6C.",
      "mapImage": "img/GeiselLib.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163025",
      "link": "https://commons.ucsd.edu/",
      "tags": [
        "as",
        "ws"
      ]
    },
    {
      "name": "Tech Lending Program (TLP)",
      "description": "The Tech Lending Program (TLP) circulates technology items, from calculators to digital cameras, to currently enrolled UC San Diego faculty, staff, and students. This is an effort by the Library to ensure that our users have the technological means to conduct research, and complete coursework as efficiently and effectively as possible. TLP’s initial inventory consists mostly of frequently requested items like device chargers, adapters (e.g., mini-HDMI to HDMI), flash drives, and headsets. A few high-end devices are also offered, including digital cameras, projectors, and Rokus. Non-electronic items include book stands and wrist rests. 2",
      "mapImage": "img/CommBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=163048",
      "link": "https://library.ucsd.edu/computing-and-technology/tech-lending/index.html",
      "tags": [
        "eq"
      ]
    },
    {
      "name": "UCSD Academy for Transfer Students",
      "description": "The 2017 UC San Diego Academy for Transfer Students is intended for incoming transfer students (belonging to the Biological Sciences, Computer Science and Engineering, or Mathematics departments) who will be entering UC San Diego in the Fall quarter from a community college or from a four year college.  It is a five-week program where students can earn 8 units of credit (10 units for CSE and Math-CS students) in the major. The Academy primarily consists of gateway courses that are not typically offered at community colleges.The Academy also includes advising and other activities to help students smoothly transition to UC San Diego.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "http://academy.eng.ucsd.edu/",
      "tags": [
        "as",
        "ev"
      ]
    },
    {
      "name": "University Art Gallery",
      "description": "Located on the outskirts of the Mandeville Center, near the Main Gym, The University Art Gallery aims to activate new fields of knowledge production, new material, discursive, and critical possibilities -- alternative forms of organization, exchange, collection, and presentation that can be incorporated into new understandings of artistic endeavor. Working with the conditions and interrelationships of publics, space, discourse, and pedagogy, it enhances the dialogue around diversity within contemporary cultural practice and supports fellows and students in their academic and professional development as curators, critics, writers and scholars.",
      "mapImage": "img/MandevilleBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=229230",
      "link": "https://visarts.ucsd.edu/about/facilities.html",
      "tags": [
        "sc"
      ]
    },
    {
      "name": "Virtual Computing Labs",
      "description": "The Virtual Computing Labs provide a virtual workspaces that can be accessed through the UCSD VPN, and provides students with a range of software programs like ArcGIS, Matlab, and SOLIDWORKS.",
      "mapImage": "img/CP Generic Icon.jpg",
      "link": "http://acms.ucsd.edu/students/govirtual/index.html",
      "tags": [
        "eq",
        "ws"
      ]
    },
    {
      "name": "Visual Arts Facility",
      "description": "Located between the Structural Materials and Engineering Building (SME) and Pepper Canyon Hall, the Visual Arts Facility hosts visual arts graduate student studios, a seminar room, the graduate photo lab, a computer lab, a gallery, and a performance space, a sound lab and a screening room.",
      "mapImage": "img/VAFBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=229265",
      "link": "https://visarts.ucsd.edu/about/facilities.html",
      "tags": [
        "bs",
        "ws",
        "bd"
      ]
    },
    {
      "name": "Wood & Metal Shops",
      "description": "Located in the Mandeville Center, these facilities provide access to wood/metal cutting tools to undergraduate students.",
      "mapImage": "img/MandevilleBldg.jpg",
      "mapLink": "https://maps.ucsd.edu/map/?id=1005&mrkIid=229230",
      "link": "https://visarts.ucsd.edu/about/facilities.html",
      "tags": [
        "ws"
      ]
    }
  ],
  "resourceTags": {
    "as": "Academic Support",
    "bs": "Buildings",
    "cr": "Careers",
    "ev": "Events",
    "sc": "Showcases",
    "eq": "Equipment",
    "ws": "Workspaces"
  },
  "resourceBanner": [
    {
      "name": "Digital Media Lab",
      "image": "img/resourceBanner/Digital Media Lab.jpg",
      "link": "https://library.ucsd.edu/computing-and-technology/digital-media-lab/"
    },
    {
      "name": "Media Teaching Lab",
      "image": "img/resourceBanner/Media-Teaching-Lab.jpg",
      "link": "http://acms.ucsd.edu/students/medialab/"
    },
    {
      "name": "University Art Gallery",
      "image": "img/resourceBanner/University Art Gallery.jpg",
      "link": "https://visarts.ucsd.edu/about/facilities.html"
    },
    {
      "name": "Calit2 Protyping Lab",
      "image": "img/resourceBanner/Calit2 Prototyping Lab.jpg",
      "link": "http://www.calit2.net/"
    },
    {
      "name": "Computer Science Basement",
      "image": "img/resourceBanner/Computer-Science-Basement.jpg",
      "link": "https://cse.ucsd.edu/about/computer-science-and-engineering-building-ebu3b"
    },
    {
      "name": "Design Lab",
      "image": "img/resourceBanner/Design Lab.jpg",
      "link": "http://designlab.ucsd.edu/"
    },
    {
      "name": "Jacobs School of Engineering",
      "image": "img/resourceBanner/Jacobs-School-of-Engineering.jpg",
      "link": "http://jacobsschool.ucsd.edu"
    },
    {
      "name": "IDEA Learning Center",
      "image": "img/resourceBanner/IDEA-Learning-Center.jpg",
      "link": "http://jacobsschool.ucsd.edu/idea/resources/idea_studylab.shtml"
    },
    {
      "name": "Conrad Prebys Music Center",
      "image": "img/resourceBanner/Conrad Prebys Music Center.jpg",
      "link": "http://musicweb.ucsd.edu/about/about-pages.php?i=441"
    },
    {
      "name": "CSE Building",
      "image": "img/resourceBanner/Computer Science & Engineering Building.jpg",
      "link": "https://cse.ucsd.edu/about/computer-science-and-engineering-building-ebu3b"
    }
  ],
  "projects": [
    {
      "name": "Studyspace.me",
      "imageFolder": "studyspace",
      "organization": "CSE 110",
      "intro": "Studyspace.me is a casual social platform for studying, collaboration, and meetings.",
      "description": "For the course CSE 110 (Software Engineering), students are offered the opportunity to learn common software practices used in industry on an application which they build with a small team of developers. Each team has one quarter to create a project that demonstrates a creative solution to a problem.\n\nAs their solution, the Studyspace team developed a website that connects students with peers and instructors instantly via video and text chat. Through the application, classmates can collaborate in course-specific channels to tackle challenging topics, ask questions, and prepare for exams. The website provides a multifaceted digital workspace that can host a range of activities, like TA office hours, group study sessions, and even a lounge area where students can share music and chat.\n\nThe project boasts a mix of techniques and backend software implementations, including Express.js, Firebase, MongoDB, and PeerJS. Studyspace also incorporates creative frontend and visual design features like alternate app color schemes and day/night modes that ensure the site is easy on the eyes for long periods of time. \n\nThe CSE 110 (Software Engineering) course focuses on an introduction to software development and engineering methods, including specification, design, implementation, testing, and process, as well as an emphasis on team development, agile methods, and use of tools as IDE's, version control, and test harnesses.",
      "members": [
        "Eric Zhang",
        "Isaac Wang",
        "Andy Hwang",
        "Gates Zeng",
        "Michael Youssef",
        "Saurabh Kulkarni",
        "Anish Sinha",
        "Luke Thomas",
        "Zaki Siddiqui",
        "Kent Vuong"
      ],
      "images": [
        "/img/projectImages/studyspace/1.jpg",
        "/img/projectImages/studyspace/2.jpg",
        "/img/projectImages/studyspace/3.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/JOMxcJhTfeo"
      ],
      "link": "https://www.studyspace.me/",
      "tags": [
        "wa"
      ]
    },
    {
      "name": "KAi Human Robot Arm",
      "imageFolder": "kaiRobot",
      "organization": "Divergent Engineering",
      "intro": "Engineering students craft a humanoid robot hand with the help of an Arduino microcontroller.",
      "description": "KAi is a human robot based on the open source humanoid robot, “Inmoov”. The Divergent Engineering team successfully built an operational arm with five human-like fingers controlled using five flex sensors. The arm is controlled by an Arduino Uno wired to several potentiometers that recreate the motion of human hands with animatronic “joints”.\n\nThe team has programmed KAi to be autonomous with certain preset hand signs, such as the peace sign. KAi is even able to play a game of rock-paper-scissors with the user motioning out the game’s commonly used hand signs. Using the newly developed muscle sensors, which allows user muscle movement to be recorded by the Arduino,  the team plans to implement a glove-like mechanism to control the fingers.",
      "members": [
        "Phuong Truong",
        "Karcher Morris",
        "Alex Phan",
        "Raul Pegan",
        "Ella Kan"
      ],
      "images": [
        "/img/projectImages/kaiRobot/1.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/Cx13LD9fahg",
        "https://www.youtube.com/embed/IZ0l6Lv10O4"
      ],
      "link": false,
      "tags": [
        "ar"
      ]
    },
    {
      "name": "Potholes in San Diego",
      "imageFolder": "potholesSD",
      "organization": "COGS 108",
      "intro": "Working with immense amounts of data, a team of cognitive science students tackle the growing pothole problem in San Diego.",
      "description": "“People have become so desensitized to potholes that their frustration with them has become an everyday routine. For the safety of people and their cars, we asked, what approaches can be taken towards increasing the efficiency of pothole repair? And where should San Diego be allocating their pothole workers and resources?”\n\nThose were the questions asked by a team of students taking the COGS 108 (Data Science in Practice) course. Working with immense amounts of public data, the team first generated visual heat maps of San Diego potholes with the help of the ArcGIS program. They then compared pothole data with a range of other conditions, including the presence of bus stops, parking meters, and population. Using statistical algorithms, computer programming languages, and industry-standard software, the team was able to analyze the complex relations between all of the factors and develop recommendations for how the city of San Diego might begin to solve their issues with potholes. The project demonstrates the practicality of a computing-based approach in data science.",
      "members": [
        "Lee Anne Mercado",
        "Maggie Chan",
        "Tim Lee",
        "Vinh Doan",
        "Young Jin Yun"
      ],
      "images": [
        "/img/projectImages/potholesSD/1.jpg",
        "/img/projectImages/potholesSD/2.jpg",
        "/img/projectImages/potholesSD/3.jpg",
        "/img/projectImages/potholesSD/4.jpg"
      ],
      "videos": [],
      "link": "https://github.com/tjl014/Projects/blob/master/Potholes%20in%20San%20Diego.ipynb",
      "tags": [
        "da"
      ]
    },
    {
      "name": "me-mo",
      "imageFolder": "memo",
      "organization": "COGS 120",
      "intro": "me-mo is a mobile personal travelling app, allowing individuals to document their travels.",
      "description": "For the course COGS 120 (Interaction Design) with Professor Philip Guo, students develop a quarter-long project where they design and develop a mobile application within a given premise. In response to the topic Visualizing and Interacting with Histories, Tori Duong (‘18), Melissa Ngu (‘17), and Ed Ngai (‘17) wondered how they might help people represent and interact with histories in a visual way. Their solution was “me-mo”, a personal traveling app that helps users keep track of places they’ve been to or want to visit in the future. The team of three approached the project by first studying the needs of users and using storyboards to illustrate the different personas and scenarios in which their app would be used. Working with criticism and review from their classmates, the team went on to rapid prototyping and developing low-fidelity wireframes which were then tested on users. Their final project incorporates a wide array of techniques and insight gained from the COGS 120 course. \n\nThe COGS 120 (Interaction Design) course is structured through weekly skill-building assignments and regular small design studio sessions designed to foster constructive conversations around each team’s progress throughout the quarter. ",
      "members": [
        "Tori Duong",
        "Melissa Ngu",
        "Ed Ngai"
      ],
      "images": [
        "/img/projectImages/memo/1.jpg",
        "/img/projectImages/memo/2.jpg",
        "/img/projectImages/memo/3.jpg"
      ],
      "videos": [],
      "link": "https://toriduong.github.io/",
      "tags": [
        "ma"
      ]
    },
    {
      "name": "Hash Functions in Cryptography",
      "imageFolder": "hashCryptography",
      "organization": "CSE 191",
      "intro": "Julia Len researches and proposes improvements to modern cryptography and data security.",
      "description": "If you’ve ever logged into Gmail or Facebook, you’ve used a hash function. Hash functions are the tools with which we protect our valuable data–data like passwords on social media sites, banking information, or even the messages you send over Apple’s iMessage. Computer Science student Julia Len notes that it has been proven that hash functions can be broken, and therefore accessed by a third party–so how can we improve these systems? In response, Len showcases proofs that simplify hash conversion and ultimately bolster safety guarantees of online data. The project promises to increase confidence in the security of people’s everyday interactions.\n\nLen fell in love with cryptography after taking CSE 107 (Introduction to Cryptography). She decided to take CSE 191 (Projects in Cryptography), where she worked with Professor Mihir Bellare and graduate student Joseph Jaeger to develop this project. Their research was successful enough that the accompanying paper was accepted by the 2017 ACM Conference on Computer and Communications Security (CCS), where Len will be presenting her work.",
      "members": [
        "Julia Len",
        "Joseph Jaeger",
        "Prof. Mihir Bellare"
      ],
      "images": [
        "/img/projectImages/hashCryptography/1.jpg",
        "/img/projectImages/hashCryptography/2.jpg"
      ],
      "videos": [],
      "link": "https://ucsdnews.ucsd.edu/pressrelease/computer_science_major_honored_for_undergraduate_research_in_applied_crypto",
      "tags": [
        "re"
      ]
    },
    {
      "name": "California Micromouse Competition",
      "imageFolder": "micromouse",
      "organization": "IEEE",
      "intro": "CAMM is a collegiate engineering competition where teams compete to create the best maze-solving robots.",
      "description": "The Micromouse competition has been around since its introduction by IEEE in 1977, and since 2006 we have been working on our own Micromouse projects here in UC San Diego to compete with other schools. The competition featured a 16x16 grid maze and was led by a wall-following robot-mouse, with objective to solve the maze as fast as possible without outside assistant or human control. To meet with popular demand, since 2011 we have hosted our own competition called the California Micromouse Competition (CAMM) at UC San Diego. Every year, IEEE at UC San Diego receives more than 200 applications and are able to sponsor 40 UC San Diego students to participate in the Micromouse Project, and we also have multiple schools from the west coast attending our competition.\n\nIn 2016, more than half of the awards at CAMM Competition was won by UCSD teams. They are: 2nd Place (Kevin Tain), Most Cells Traversed (Will Bui, Austin Hermida, Jocelyn Tran, Achint Singh, Andy Zhang), Design Award (Javier Urquizu, Eddie Calva, Christopher Lew, Nahoon Hwang), and Judge’s Favorite (Fengjunyan Li, Austin Xiao, Haoran Wang, Zhouhang Shao, Haocheng Liang). This project is an opportunity for students to learn and apply various hands-on skills critical for electrical engineers and computer scientists, including EagleCAD, digital signal processing, and microcontroller programming. Other than the technical skills, it is equally important for students to develop collaboration and research skills to help them along the way working in a competitive environment.",
      "members": [],
      "images": [
        "/img/projectImages/micromouse/1.jpg",
        "/img/projectImages/micromouse/2.jpg",
        "/img/projectImages/micromouse/3.jpg",
        "/img/projectImages/micromouse/4.jpg"
      ],
      "videos": [],
      "link": "http://micromouseusa.com/",
      "tags": [
        "ar"
      ]
    },
    {
      "name": "Endless",
      "imageFolder": "endless",
      "organization": "VIS 141A",
      "intro": "Endless is a looping, psychological videogame developed in the Computer Programming for the Arts course.",
      "description": "Endless is a looping, psychological videogame developed for the course VIS 141A (Computer Programming for the Arts I) by Interdisciplinary Computing & the Arts student Oliver Engel (‘18). Using the Unity 3D engine, a series of basic puzzles are presented to the player, who is given a time limit to complete each. Upon completing the series of puzzles, the player is thrown back to the first puzzle, and finds that the controls and perspective have been altered, causing the puzzle to increase in difficulty. Each successive loop continues to distort the player’s experience, activating swirling walls of music and overwhelming sensory information as the game progresses. The game acts as a test of endurance in the face of information saturation and only rewards the user with a high score, depending on the amount of loops completed.\n\nThe game was completed with techniques and skills taught in the project-based VIS 141A course under Professor Brett Stalbaum, which allows students to gain API fluency through planning and coding software or software mediated art projects. In particular, this game was programmed with the C++ language and designed in Unity 3D.",
      "members": [
        "Oliver Engel"
      ],
      "images": [
        "/img/projectImages/endless/1.jpg",
        "/img/projectImages/endless/2.jpg",
        "/img/projectImages/endless/3.jpg",
        "/img/projectImages/endless/4.jpg",
        "/img/projectImages/endless/5.jpg"
      ],
      "videos": [],
      "link": false,
      "tags": [
        "ga"
      ]
    },
    {
      "name": "Gentrification in San Diego",
      "imageFolder": "gentrification",
      "organization": "COGS 108",
      "intro": "A team of cognitive science students enter the debate over gentrification by analyzing and visualizing mass amounts of data.",
      "description": "“How does gentrification contribute to changes in San Diego demographics? In particular, how do factors such as crime, home value, housing income and racial diversity change as a result of gentrification?”\n\nFor the final project in COGS 108 Data Science in Practice), one team posed this poignant question. The team first approached the issue by identifying gentrified San Diego neighborhoods, and then conducting a range of data visualization and statistical methods in order to meaningfully structure the large amounts of data present. In particular, the team explored how factors such as crime, home value, housing income and racial diversity change as a result of gentrification. Their purpose in exploring the subject was to shed light on a civic concern that’s widely disputed and debated in cities across the country.",
      "members": [
        "Abena Bonsu",
        "Lauren Liao",
        "Megan Chang",
        "Raymond Arevalo"
      ],
      "images": [
        "/img/projectImages/gentrification/1.jpg",
        "/img/projectImages/gentrification/5.jpg",
        "/img/projectImages/gentrification/2.jpg",
        "/img/projectImages/gentrification/3.jpg",
        "/img/projectImages/gentrification/4.jpg"
      ],
      "videos": [],
      "link": "https://github.com/mec029/Pr_057/blob/master/FinalProject.ipynb",
      "tags": [
        "da"
      ]
    },
    {
      "name": "Arduino Pong",
      "imageFolder": "arduinoPong",
      "organization": "2017 H.A.R.D. Hack",
      "intro": "The Arduino Pong project, created during the 2017 H.A.R.D. Hack at UCSD,  is a modern take on the classic game, Pong.",
      "description": "The game is designed to be a single player Pong game where the user faces the upper edge of the screen, a randomly generated horizontal wall, and a pong ball with gradually increasing speed. The user must maneuver a small platform, the paddle, to prevent the moving pong ball from passing the lower edge of the screen.\n\nThe screen is split in half where the left side of the display is the actual game, while the right side is a score tracker. The score can be arbitrarily set to determine a winner, for example, the team normally tests the game with a set score of 15.\n\nThe project was built using an Arduino Uno with 1 output and 1 input. For the output, the team daisy chained four 8x8 LED matrices to create a 64x64 grid of red LEDs to create the display screen for the player. For the input, the player uses a traditional joystick, which controls the paddle.",
      "members": [
        "Austin Hermida",
        "Eric Ho",
        "Jeffry Jaman"
      ],
      "images": [
        "/img/projectImages/arduinoPong/1.jpg"
      ],
      "videos": [
        "https://www.youtube.com/embed/3nQwyJF6FP8"
      ],
      "link": "https://www.youtube.com/watch?v=3nQwyJF6FP8&feature=youtu.be",
      "tags": [
        "ar"
      ]
    },
    {
      "name": "Gokoban",
      "imageFolder": "gokoban",
      "organization": "2017 Gopher Game Jam",
      "intro": "Gokoban is a 3D box-pushing elevator-riding award-winning puzzle game developed by Electrical Engineering student Daniel Salvadori.",
      "description": "Gokoban is a 3D box-pushing elevator-riding award-winning puzzle game. It was awarded 1st place in the 2017 Gopher Game Jam - an international competition where participants make a game in 3 months using the Go programming language. In the game, players control the Go gopher (the Go mascot) and your objective is to push the boxes until they are all on top of the marked pads. There are elevators that help you reach high places and move boxes up and down. Gokoban was inspired by traditional sokoban-style puzzles but with the added 3D aspect.\n\nGokoban  was created using G3N, an open-source 3D game engine created by Salvadori and his dad. At the time there weren't any active full-fledged game engines in Go, and he decided that building one together would be a great way to have fun while talking about math, algorithms and programming. When he heard about the Gopher Game Jam, Salvadori knew he had to make a game for it using his own 3D engine. \n\nGokoban, like G3N, is also completely open source, meaning all the game source code, sounds, textures, levels and 3D models are freely available online. It’s easy to modify the levels and even create new ones - there's no coding involved!",
      "members": [
        "Daniel Salvadori"
      ],
      "images": [
        "/img/projectImages/gokoban/1.jpg",
        "/img/projectImages/gokoban/2.jpg",
        "/img/projectImages/gokoban/3.jpg",
        "/img/projectImages/gokoban/4.jpg",
        "/img/projectImages/gokoban/5.jpg"
      ],
      "videos": [],
      "link": "https://github.com/danaugrs/gokoban",
      "tags": [
        "ga"
      ]
    }
  ],
  "projectTags": {
    "ma": "Mobile App",
    "wa": "Web App",
    "ar": "Arduino",
    "da": "Datamining",
    "re": "Research",
    "ga": "Game"
  },
  "orgs": [
    {
      "name": "Biomedical Engineering Society",
      "description": "The Biomedical Engineering Society (BMES) at the University of California, San Diego (UCSD) is dedicated to enriching the undergraduate experience for those in the Department of Bioengineering and for those interested in Biomedical Engineering by fostering personal growth and professional development.",
      "orgImage": "img/OrgLogos/BMES.png",
      "link": "http://bmes.ucsd.edu/",
      "tags": [
        "ms",
        "en"
      ],
      "dark": false
    },
    {
      "name": "Cognitive Science Student Association",
      "description": "The Cognitive Science Student Association was established to build and maintain a community of students with interest in the multidisciplinary aspects of Cognitive Science.  They maintain a strong relationship with UCSD’s prestigious Cognitive Science Department in order to deliver academic opportunities to our members and stay up-to-date with the most cutting edge research of Cognitive Science.  They also connect with professional groups in the San Diego area in order to help their members discover the multidisciplinary qualifications that Cognitive Science offers to the professional world.",
      "orgImage": "img/OrgLogos/CSSA.png",
      "link": "http://cssa.ucsd.edu/",
      "tags": [
        "ms"
      ],
      "dark": true
    },
    {
      "name": "Computer Science and Engineering Society",
      "description": "The Computer Science and Engineering Society (CSES) aims to form a passionate community of computer scientists and engineers at UC San Diego. From tech talks, to social events, to outreach, they have a diverse set of events and activities that appeal to any computer scientist or engineer.",
      "orgImage": "img/OrgLogos/CSES.png",
      "link": "https://cses.ucsd.edu/",
      "tags": [
        "cs",
        "en"
      ],
      "dark": false
    },
    {
      "name": "CSforeach",
      "description": "CS foreach is a non-profit student organization with the goal of increasing access to Computer Science education throughout San Diego county by initiating efforts to teach in underserved communities and cultivating mentorship between UCSD and K-12 students.",
      "orgImage": "img/OrgLogos/CSforeach.png",
      "link": "http://csforeach.ucsd.edu/",
      "tags": [
        "cs"
      ],
      "dark": false
    },
    {
      "name": "Data Science Student Society",
      "description": "The Data Science Student Society at UCSD is an interdisciplinary academic organization designed to immerse the community in the diverse and growing facets of Data Science: Machine Learning, Computational Statistics, Data Mining, Visualization, Predictive Analytics, and any new emerging relevant fields of study. With practical hands-on data projects, a professional portfolio-building approach, and fun outreach activities, the Data Science Student Society at UCSD strives to enrich the academic life of the student community by strengthening them for success in their current and future pursuits of Data Science related fields.",
      "orgImage": "img/OrgLogos/DS3.png",
      "link": "http://ds3.ucsd.edu/",
      "tags": [
        "cs",
        "ms"
      ],
      "dark": false
    },
    {
      "name": "Design at UCSD",
      "description": "A student-led group of designers focused on UX design, research, and design thinking with an appreciation for all design fields and related disciplines. Their organization is dedicated to three core values: preparing students to enter industry, getting students involved in the design community, and an emphasis on human-centered design.",
      "orgImage": "img/OrgLogos/Design@UCSD.png",
      "link": "http://designatucsd.org/",
      "tags": [
        "ad"
      ],
      "dark": false
    },
    {
      "name": "Design for America",
      "description": "Design for America (DFA) is a national organization with that supports chapters from San Diego to New York City. It guides interdisciplinary teams to apply the design process to tackle extraordinary challenges in health, economy, education, and environment. DFA projects fuse collaboration, leadership, and creativity.",
      "orgImage": "img/OrgLogos/DFA_UCSD.png",
      "link": "http://designforamerica.com/studio/dfa-ucsd/",
      "tags": [
        "ad"
      ],
      "dark": true
    },
    {
      "name": "Divergent Engineering",
      "description": "Divergent Engineering (divE) began as an Arduino workshop with 6 engineers and a simple objective: teach students how program Arduino microcontroller boards and see what they can do with that knowledge. What started out as a workshop became an incubator that produced a working data logger, persistence of vision wand, a Skittle sorter, and a wall-avoiding robot in a single month.<br><br>Divergent Engineering aims to provide a nurturing environment for students to formulate and develop their goals as engineers and scientists; a place to begin accomplishing these goals; and a supportive setting to tinker, learn, challenge, and engineer.",
      "orgImage": "img/OrgLogos/DivE.png",
      "link": "http://divergentengineering.weebly.com/",
      "tags": [
        "cs",
        "en"
      ],
      "dark": false
    },
    {
      "name": "ECE Undergraduate Student Council",
      "description": "The Undergraduate Student Council is the representative of Electrical and Computer Engineering (ECE) undergraduate students at the University of California, San Diego (UCSD). Through networking, programming, leadership, and relevant education, the council strives to effect change within the department and campus at large, building a stronger and longer-lasting community for current and future engineers.",
      "orgImage": "img/OrgLogos/ECEUSC.png",
      "link": "http://eceusc.ucsd.edu/",
      "tags": [
        "en"
      ],
      "dark": false
    },
    {
      "name": "Game Development Studio",
      "description": "The Game Development Studio (GDS) is an UCSD student organization dedicated to helping students gain experience in game design through collaborative projects. They are dedicated to working with a number of different platforms such as iPhones, Androids, and PCs. GDS is open to students from all different majors and backgrounds to join the club.",
      "orgImage": "img/OrgLogos/GameDevStudio.png",
      "link": "https://www.facebook.com/groups/GameDevStudio/",
      "tags": [
        "cs",
        "ad"
      ],
      "dark": false
    },
    {
      "name": "Society of Women Engineering(SWE)",
      "description": "An organization dedicated to promoting women in engineering and science. Everybody is welcome to join, provided that they support women in engineering.",
      "orgImage": "img/OrgLogos/SWE.png",
      "link": "http://swe.ucsd.edu/",
      "tags": [
        "en"
      ],
      "dark": false
    },
    {
      "name": "Society of Undergraduate Mathematics Students(SUMS)",
      "description": "SUMS strives to serve UCSD’s mathematics community and department by promoting mathematics and related fields and industries. SUMS hosts talks, technical workshops, professional events, panels, peer advising, and social events in a collaboration among like-minded students, faculty, and staff.",
      "orgImage": "img/OrgLogos/SUMS.png",
      "link": "http://sums.ucsd.edu/",
      "tags": [
        "en",
        "cs",
        "ms"
      ],
      "dark": false
    },
    {
      "name": "Triton Engineering Student Council",
      "description": "The Triton Engineering Student Council (TESC) exists to promote academic excellence, community involvement, and strong ethical values among the students of the Jacobs School of Engineering. TESC unites the engineering student organizations and sponsors events that benefit all engineering students.",
      "orgImage": "img/OrgLogos/TESC.png",
      "link": "http://tesc.ucsd.edu/",
      "tags": [
        "en"
      ],
      "dark": false
    },
    {
      "name": "Triton 3D",
      "description": "Triton 3D was founded by students with an interest in the applications of additive manufacturing and rapid prototyping. The goal was that in doing so, they could bring together students of all levels of experience that had an interest. From its inception in January 2015, Triton 3D had humble beginnings as a loose aggregate of students who were interested in 3D printing technology, but quickly grew into the school’s premiere source for 3D printing expertise and support.<br><br>Today, the organization has several active project teams with professors on cutting edge research, runs regular tutorials on CAD design and 3D printing, and provides technical support and advancement with existing design studios on campus.",
      "orgImage": "img/OrgLogos/Triton3D.png",
      "link": "http://t3d.ucsd.edu/",
      "tags": [
        "cs",
        "ad"
      ],
      "dark": false
    },
    {
      "name": "UCSD IEEE",
      "description": "IEEE is the world's largest professional association dedicated to advancing technological innovation and excellence for the benefit of humanity.<br><br>It is a non-profit organization, is the world’s leading professional association for the advancement of technology. Through its global membership, the IEEE is a leading authority on areas ranging from aerospace systems, computers and telecommunications to biomedical engineering, electric power and consumer electronics among others.<br><br>Members rely on the IEEE as a source of technical and professional information, resources and services. To foster an interest in the engineering profession, the IEEE also serves student members in colleges and universities around the world. Other important constituencies include prospective members and organizations that purchase IEEE products and participate in conferences or other IEEE programs.",
      "orgImage": "img/OrgLogos/IEEE.png",
      "link": "http://ieeeucsd.org/",
      "tags": [
        "en"
      ],
      "dark": false
    },
    {
      "name": "UCSD AUVSI",
      "description": "The UC San Diego Autonomous Airplane Team designs, builds, tests and flies their own autonomous flying vehicle. They design their system from the ground up, do their own engineering, and fabricate the final product themselves. They find their own sponsors, manage their own resources, and conduct their own public relations. Their test pilots are students or professional volunteers. Student designed. Student built. Student competition.",
      "orgImage": "img/CP Generic Icon.jpg",
      "link": "http://auvsi.ucsd.edu/",
      "tags": [
        "en"
      ],
      "dark": false
    },
    {
      "name": "Undergraduate Bioinformatics Club",
      "description": "The Undergraduate Bioinformatics Club (UBIC) is an academic student organization at UCSD dedicated to supporting bioinformatics students and students interested in bioinformatics by facilitating access to jobs, internships, and research opportunities; events, programs, and seminars; communication, collaboration, and socialization between bioinformatics students; and more.",
      "orgImage": "img/OrgLogos/UBIC.png",
      "link": "http://ubic.ucsd.edu/",
      "tags": [
        "ms"
      ],
      "dark": false
    },
    {
      "name": "Video Game Development Club",
      "description": "The Video Game Development Club seeks to bring students who are interested in the process of video game design and development together in a collaborative environment. Students can develop games from start to finish with their peers, and seek feedback and assistance with ideas and projects they may be working on.",
      "orgImage": "img/CP Generic Icon.jpg",
      "link": "https://www.facebook.com/groups/VGDC.UCSD/",
      "tags": [
        "cs",
        "ad"
      ],
      "dark": false
    },
    {
      "name": "Virtual Reality Club at UCSD",
      "description": "The Virtual Reality Club at UCSD is a student organization at UC San Diego that connects members with the VR industry through workshops, projects, and networking. Our mission is to foster a multidisciplinary community dedicated to exploring and creating Virtual and Augmented Reality experiences.",
      "orgImage": "img/OrgLogos/VR_Club.png",
      "link": "http://vrclub.ucsd.edu/",
      "tags": [
        "cs",
        "ad"
      ],
      "dark": false
    },
    {
      "name": "Women in Computing",
      "description": "Women in Computing are coders and engineers - both women and men - who support the female presence in computing. They run events, from tech talks to socials, and provide opportunities for female engineers to connect and succeed.",
      "orgImage": "img/OrgLogos/WIC.png",
      "link": "http://wic.ucsd.edu/",
      "tags": [
        "cs",
        "en"
      ],
      "dark": true
    },
    {
      "name": "24fps",
      "description": "24FPS is a film fluency and production club curated to include individuals interested and motivated about learning about film history, production, and experimentation within the medium. This club aims to give voice and purpose to media makers on campus, encouraging collaboration towards final cinematic projects. Members are given an opportunity to learn from the ground up as independent filmmakers and critics, using their ingenuity, arguments, and peers to establish skills in media. Meetings consist of open forum discussion, project assignments, and networking. ",
      "orgImage": "img/CP Generic Icon.jpg",
      "link": "https://www.facebook.com/24FPSucsd/",
      "tags": [
        "ad"
      ],
      "dark": false
    }
  ],
  "orgTags": {
    "ad": "Arts & Design",
    "cs": "Computer Science",
    "en": "Engineering",
    "ms": "Math & Science"
  }
}
