{
  "pages": [
    {
      "link": "/stories.html",
      "name": "Stories"
    },
    {
      "link": "/majors.html",
      "name": "Majors"
    },
    {
      "link": "/connect.html",
      "name": "Connect"
    },
    {
      "link": "/projects.html",
      "name": "Projects"
    },
    {
      "link": "/resources.html",
      "name": "Resources"
    }
  ],
  "stories": [
    {
      "name": "Jasmine Wang",
      "major": "Cognitive Science",
      "class": "2016",
      "quote": "In CogSci, we learn about the brain, the language, the connection between neurons. Then, I find out we can learn about the computation. We can think about Artificial Intelligence (AI). If you’re even slightly interested, take a leap of faith, take a couple elective classes, I bet you’ll fall in love with it.",
      "image": "/img/JasmineWang.jpg"
    },
    {
      "name": "Sarah Guthals, Professor, Co-founder of ThoughtSTEM",
      "major": "Computer Science Engineering",
      "class": "2014",
      "quote": "What I wanted was problem solving. A friend of mine told me to try a computer science class. So I took my first class, CSE 8A with Professor Beth Simon and I absolutely fell in love. I had no clue what I was doing. I would sit in the labs completely lost, but I loved it because there was always a process to follow. There was always a way of figuring it out.",
      "image": "/img/SarahGuthals.jpg"
    },
    {
      "name": "Tom Erbe, Professor",
      "major": "Interdisciplinary Computing and the Arts - Music",
      "quote": "You might not know exactly where you’re going, but keep your interests in the forefront and things will open up. When I went to school, you couldn’t integrate art and technology in any meaningful way… but I found a position where I could do this. You find these opportunities and you weigh what’s important.",
      "image": "/img/TomErbe.jpg"
    }
  ],
  "majors": [
    {
      "name": "Bioinformatics",
      "cap": true,
      "degree": "bs",
      "departments": [
        "bsc",
        "cse",
        "bie"
      ],
      "hook": "Bioinformatics majors address the growing need for trained computational biologists in the rapidly growing field of biological data analysis.",
      "websites": [
        "http://bioinformatics.ucsd.edu/"
      ],
      "image": "/img/Bioinformatics.jpg",
      "short": "bio"
    },
    {
      "name": "Cognitive Science",
      "cap": false,
      "degree": "bs",
      "departments": [
        "cog"
      ],
      "hook": "Cognitive Science students are at the forefront of researching solutions and developing technology designed to better suit humanity.",
      "websites": [
        "http://www.cogsci.ucsd.edu/"
      ],
      "image": "/img/CognitiveScience.jpg",
      "short": "cog"
    },
    {
      "name": "Computer Science",
      "cap": true,
      "degree": "bs",
      "departments": [
        "cse"
      ],
      "hook": "Computer science students gain knowledge in key computing theories and languages, directly preparing them to enter high tech industry.",
      "websites": [
        "https://cse.ucsd.edu/"
      ],
      "image": "/img/ComputerScience.jpg",
      "short": "cse"
    },
    {
      "name": "Electrical & Computer Engineering",
      "cap": true,
      "degree": "bs",
      "departments": [
        "cse",
        "ece"
      ],
      "hook": "Electrical and Computer Engineering students unite principles of mathematics and science to become architects of electronic systems.",
      "websites": [
        "http://www.ece.ucsd.edu/"
      ],
      "image": "/img/ElectricalEngineering.jpg",
      "short": "ece"
    },
    {
      "name": "Math-Computer Science",
      "cap": true,
      "degree": "bs",
      "departments": [
        "mat"
      ],
      "hook": "Math-Computer Science students focus on the intersection between mathematics and theoretical computer science.",
      "websites": [
        "https://math.ucsd.edu/"
      ],
      "image": "/img/Math-CS.jpg",
      "short": "mcs"
    },
    {
      "name": "Scientific Computation",
      "cap": true,
      "degree": "bs",
      "departments": [
        "mat",
        "phy",
        "cse"
      ],
      "hook": "Scientific Computation majors bridge the gap between applied mathematics, physics, and computer science.",
      "websites": [
        "https://math.ucsd.edu/",
        "https://physics.ucsd.edu/"
      ],
      "image": "/img/temp1.svg",
      "short": "sci"
    },
    {
      "name": "Interdisciplinary Computing and the Arts",
      "cap": false,
      "degree": "ba",
      "departments": [
        "vis",
        "mus"
      ],
      "hook": "Interdisciplinary Computing and the Arts students embody the new generation of artists and musicians.",
      "websites": [
        "http://musicweb.ucsd.edu/ugrad/ugrad-pages.php?i=103",
        "http://visarts.ucsd.edu/icam-interdisciplinary-computing-and-arts-minor"
      ],
      "image": "/img/ICAM.jpg",
      "short": "ica"
    },
    {
      "name": "Speculative Design",
      "cap": false,
      "degree": "ba",
      "departments": [
        "vis"
      ],
      "hook": "Speculative Design is a 21st century mix of art, science, and emerging technology focused on aesthetic and entrepreneurial and activist intervention.",
      "websites": [
        "http://visarts.ucsd.edu/majors-0"
      ],
      "image": "/img/SpecDesign.jpg",
      "short": "spc"
    },
    {
      "name": "Data Science",
      "cap": false,
      "degree": "bs",
      "departments": [
        "cse"
      ],
      "hook": "Data scientists use mathematics and computing to tackle the emerging need for data analysis in a wide range of industries.",
      "websites": [
        "http://jacobsschool.ucsd.edu/mas/dse/"
      ],
      "image": "/img/DataScience.jpg",
      "short": "dat"
    }
  ],
  "degrees": {
    "bs": "Bachelor of Science",
    "ba": "Bachelor of Arts"
  },
  "departments": {
    "bsc": "Biological Sciences",
    "bie": "Bioengineering",
    "cog": "Cognitive Sciences",
    "cse": "Computer Science",
    "ece": "Electrical Engineering",
    "mat": "Mathematics",
    "phy": "Physics",
    "vis": "Visual Arts",
    "mus": "Music"
  },
  "majorDescriptions": {
    "bio": "[Placeholder - need condensed overall description]",
    "cog": "The cognitive science major is a diverse field that blends together the understanding of the brain, human behavior, and computation. Students can choose between five different specializations that span widely different disciplines including neurological & biological sciences, computational sciences, social sciences, and visual arts. Students can explore a variety of disciplines including neurological & biological sciences, computational sciences, social sciences, and visual arts, determined by their chosen specialization. Graduates of this program often go on to graduate school or work in research, UX and product design, and data analysis.",
    "cse": "The Computer Science major allows students to initially explore computer science through algorithmic problem solving and programming in various languages, including Java and C. Students then progress to topics involving a deeper understanding of computer systems including advanced data structures and computer architecture. Additional elective courses provide depth into systems and networks, database analysis, security and cryptography topics, machine learning, computer vision, and graphics. Many graduates of this program go on to graduate school or choose careers that involve machine automation, UI/UX design, data analytics, application development, artificial intelligence, networking, and security.",
    "ece": "[Placeholder - there are two majors in this category: CE and EE]",
    "mcs": "The Math-Computer Science (B.S) major is a specialized branch of mathematics, providing a focus on computer science. While not covering the same scope as a pure Computer Science major, Math CS prepares students to potentially work in a computing setting. Students are given flexibility in their course subjects, allowing the opportunity to have a greater focus on mathematics or to take a more even distribution of courses in mathematics and computer science. Students study subjects including abstract algebra, statistics and probability, combinatorics, algorithm analysis, programming, and data structures.",
    "sci": "[Placeholder - there are two departments in this category: math and physics]",
    "ica": "The Interdisciplinary Computing and the Arts major (ICAM) is an exciting blend of computer science, art, and technology that explores today’s cutting-edge media. Access to a wide range of disciplines means that students are free to tailor the program to their artistic interests, and can take classes in fields like virtual reality, design communication, film production, and physical electronics programming. ICAM students gain technical, theoretical, and historical backgrounds that prepare them to anticipate and work with emerging trends in art, music, and technology. They can choose from either music technology or visual arts focuses, which influence their upper-level coursework, but often draw from both fields during their journey through the major.",
    "spc": "The Speculative Design (B.A.) major mixes art, science, and emerging technology, with a focus on aesthetics, entrepreneurship, and activist intervention. Combining laboratory and field research in a creative studio setting, Speculative Design works from nano to urban scales to stimulate new ideas and innovative solutions. Rather than focusing on existing methodologies, this program prepares students to solve problems that will emerge in an uncertain future. Students may choose from four areas of emphasis: Public Culture and Urban Ecology, Design Computing, Design Research, and Media Design. ",
    "dat": "Data science majors use mathematical models and computational methods to craft powerful data analysis and meet the emerging needs of data-driven industries, from manufacturing companies to government organizations. The core knowledge base of the data scientist lies at the intersection of computing and mathematics, coupled with the skills to abstract, build, and test predictive and descriptive models. Students in the program can expect coursework in mathematics, computer science, and statistics, as well as foundational lower division coursework in natural and physical sciences."
  },
  "resources": [
    {
      "name": "name 1",
      "description": "description 1",
      "mapImage": "/img/APM Snap.jpg",
      "mapLink": "map1link",
      "link": "testlink1",
      "tags": [
        "as",
        "bs",
        "ws",
        "sc"
      ]
    },
    {
      "name": "name 2",
      "description": "description 2",
      "mapImage": "map2img.com",
      "mapLink": "map2link",
      "link": "testlink2",
      "tags": [
        "eq",
        "sc"
      ]
    },
    {
      "name": "name 3",
      "description": "description 3",
      "mapImage": "map3img.com",
      "mapLink": "map3link",
      "link": "testlink3",
      "tags": [
        "eq",
        "sc",
        "ev"
      ]
    }
  ],
  "resourceTags": {
    "as": "Academic Support",
    "bs": "Buildings",
    "ev": "Events",
    "sc": "Showcases",
    "eq": "Equipment",
    "ws": "Workspaces"
  },
  "projects": [
    {
      "name": "me-mo",
      "organization": "Personal Project",
      "description": "For the course COGS 120 (Interaction Design) with Professor Philip Guo, students develop a quarter-long project where they design and develop a mobile application within a given premise. In response to the topic Visualizing and Interacting with Histories, Tori Duong (‘18), Melissa Ngu (‘17), and Ed Ngai (‘17) wondered how they might help people represent and interact with histories in a visual way. Their solution was “me-mo”, a personal traveling app that helps users keep track of places they’ve been to or want to visit in the future. The team of three approached the project by first studying the needs of users and using storyboards to illustrate the different personas and scenarios in which their app would be used. Working with criticism and review from their classmates, the team went on to rapid prototyping and developing low-fidelity wireframes which were then tested on users. Their final project incorporates a wide array of techniques and insight gained from the COGS 120 course. The COGS 120 (Interaction Design) course is structured through weekly skill-building assignments and regular small design studio sessions designed to foster constructive conversations around each team’s progress throughout the quarter. ",
      "members": [
        "Tori Duong",
        "Melissa Ngu",
        "Ed Ngai"
      ],
      "link": "http://toriduong.com/me-mo.html",
      "tags": ["ma"]
    },
    {
      "name": "Studyspace.me",
      "organization": "CSE 110",
      "description": "For the course CSE 110 (Software Engineering), students are offered the opportunity to learn common software practices used in industry on an application which they build with a small team of developers. Each team has one quarter to create a project that demonstrates a creative solution to a problem.",
      "members": [
        "Eric Zhang, Isaac Wang, Andy Hwang, Gates Zeng, Michael Youssef, Saurabh Kulkarni, Anish Sinha, Luke Thomas, Zaki Siddiqui, Kent Vuong"
      ],
      "link": "https://www.studyspace.me/",
      "tags": ["wa"]
    },
    {
      "name": "KAi Human Robot Arm",
      "organization": "Divergent Engineering",
      "description": "The team has programmed KAi to be autonomous with certain preset hand signs, such as the peace sign. KAi is even able to play a game of rock-paper-scissors with the user motioning out the game’s commonly used hand signs. Using the newly developed muscle sensors, which allows user muscle movement to be recorded by the Arduino,  the team plans to implement a glove-like mechanism to control the fingers.",
      "members": [
        "Alex Phan"
      ],
      "link": "http://divergentengineering.weebly.com/kai-human-robot.html",
      "tags": ["ar"]
    }
  ],
  "projectTags": {
    "ma": "Mobile App",
    "wa": "Web App",
    "ar": "Arduino",
    "da": "Datamining",
    "re": "Research",
    "ga": "Games"
  }
}
