{
  "pages": [
    {
      "link": "/stories.html",
      "name": "Stories"
    },
    {
      "link": "/majors.html",
      "name": "Majors"
    },
    {
      "link": "/connect.html",
      "name": "Connect"
    },
    {
      "link": "/projects.html",
      "name": "Projects"
    },
    {
      "link": "/resources.html",
      "name": "Resources"
    }
  ],
  "stories": [
    {
      "name": "Jasmine Wang",
      "major": "Cognitive Science",
      "class": "2016",
      "quote": "In CogSci, we learn about the brain, the language, the connection between neurons. Then, I find out we can learn about the computation. We can think about Artificial Intelligence (AI). If you’re even slightly interested, take a leap of faith, take a couple elective classes, I bet you’ll fall in love with it.",
      "image": "/img/JasmineWang.jpg"
    },
    {
      "name": "Sarah Guthals, Professor, Co-founder of ThoughtSTEM",
      "major": "Computer Science Engineering",
      "class": "2014",
      "quote": "What I wanted was problem solving. A friend of mine told me to try a computer science class. So I took my first class, CSE 8A with Professor Beth Simon and I absolutely fell in love. I had no clue what I was doing. I would sit in the labs completely lost, but I loved it because there was always a process to follow. There was always a way of figuring it out.",
      "image": "/img/SarahGuthals.jpg"
    },
    {
      "name": "Tom Erbe, Professor",
      "major": "Interdisciplinary Computing and the Arts - Music",
      "role": "Professor",
      "quote": "You might not know exactly where you’re going, but keep your interests in the forefront and things will open up. When I went to school, you couldn’t integrate art and technology in any meaningful way… but I found a position where I could do this. You find these opportunities and you weigh what’s important.",
      "image": "/img/TomErbe.jpg"
    }
  ],
  "majors": [
    {
      "name": "Bioinformatics",
      "cap": true,
      "degree": "bs",
      "departments": [
        "bsc",
        "cse",
        "bie"
      ],
      "hook": "Bioinformatics majors address the growing need for trained computational biologists in the rapidly growing field of biological data analysis.",
      "websites": [
        "http://bioinformatics.ucsd.edu/"
      ],
      "image": "/img/Bioinformatics.jpg",
      "short": "bio"
    },
    {
      "name": "Cognitive Science",
      "cap": false,
      "degree": "bs",
      "departments": [
        "cog"
      ],
      "hook": "Cognitive Science students are at the forefront of researching solutions and developing technology designed to better suit humanity.",
      "websites": [
        "http://www.cogsci.ucsd.edu/"
      ],
      "image": "/img/CognitiveScience.jpg",
      "short": "cog"
    },
    {
      "name": "Computer Science",
      "cap": true,
      "degree": "bs",
      "departments": [
        "cse"
      ],
      "hook": "Computer science students gain knowledge in key computing theories and languages, directly preparing them to enter high tech industry.",
      "websites": [
        "https://cse.ucsd.edu/"
      ],
      "image": "/img/ComputerScience.jpg",
      "short": "cse"
    },
    {
      "name": "Electrical & Computer Engineering",
      "cap": true,
      "degree": "bs",
      "departments": [
        "cse",
        "ece"
      ],
      "hook": "Electrical and Computer Engineering students unite principles of mathematics and science to become architects of electronic systems.",
      "websites": [
        "http://www.ece.ucsd.edu/"
      ],
      "image": "/img/ElectricalEngineering.jpg",
      "short": "ece"
    },
    {
      "name": "Math-Computer Science",
      "cap": true,
      "degree": "bs",
      "departments": [
        "mat"
      ],
      "hook": "Math-Computer Science students focus on the intersection between mathematics and theoretical computer science.",
      "websites": [
        "https://math.ucsd.edu/"
      ],
      "image": "/img/Math-CS.jpg",
      "short": "mcs"
    },
    {
      "name": "Scientific Computation",
      "cap": true,
      "degree": "bs",
      "departments": [
        "mat",
        "phy",
        "cse"
      ],
      "hook": "Scientific Computation majors bridge the gap between applied mathematics, physics, and computer science.",
      "websites": [
        "https://math.ucsd.edu/",
        "https://physics.ucsd.edu/"
      ],
      "image": "/img/SciComp.jpg",
      "short": "sci"
    },
    {
      "name": "Interdisciplinary Computing and the Arts",
      "cap": false,
      "degree": "ba",
      "departments": [
        "vis",
        "mus"
      ],
      "hook": "Interdisciplinary Computing and the Arts students embody the new generation of artists and musicians.",
      "websites": [
        "http://musicweb.ucsd.edu/ugrad/ugrad-pages.php?i=103",
        "http://visarts.ucsd.edu/icam-interdisciplinary-computing-and-arts-minor"
      ],
      "image": "/img/ICAM.jpg",
      "short": "ica"
    },
    {
      "name": "Speculative Design",
      "cap": false,
      "degree": "ba",
      "departments": [
        "vis"
      ],
      "hook": "Speculative Design is a 21st century mix of art, science, and emerging technology focused on aesthetic and entrepreneurial and activist intervention.",
      "websites": [
        "http://visarts.ucsd.edu/majors-0"
      ],
      "image": "/img/SpecDesign.jpg",
      "short": "spc"
    },
    {
      "name": "Data Science",
      "cap": false,
      "degree": "bs",
      "departments": [
        "cse"
      ],
      "hook": "Data scientists use mathematics and computing to tackle the emerging need for data analysis in a wide range of industries.",
      "websites": [
        "http://jacobsschool.ucsd.edu/mas/dse/"
      ],
      "image": "/img/DataScience.jpg",
      "short": "dat"
    }
  ],
  "degrees": {
    "bs": "Bachelor of Science",
    "ba": "Bachelor of Arts"
  },
  "departments": {
    "bsc": "Biological Sciences",
    "bie": "Bioengineering",
    "cog": "Cognitive Sciences",
    "cse": "Computer Science",
    "ece": "Electrical Engineering",
    "mat": "Mathematics",
    "phy": "Physics",
    "vis": "Visual Arts",
    "mus": "Music"
  },
  "majorDescriptions": {
    "bio": "[Placeholder - need condensed overall description]",
    "cog": "The cognitive science major is a diverse field that blends together the understanding of the brain, human behavior, and computation. Students can choose between five different specializations that span widely different disciplines including neurological & biological sciences, computational sciences, social sciences, and visual arts. Students can explore a variety of disciplines including neurological & biological sciences, computational sciences, social sciences, and visual arts, determined by their chosen specialization. Graduates of this program often go on to graduate school or work in research, UX and product design, and data analysis.",
    "cse": "The Computer Science major allows students to initially explore computer science through algorithmic problem solving and programming in various languages, including Java and C. Students then progress to topics involving a deeper understanding of computer systems including advanced data structures and computer architecture. Additional elective courses provide depth into systems and networks, database analysis, security and cryptography topics, machine learning, computer vision, and graphics. Many graduates of this program go on to graduate school or choose careers that involve machine automation, UI/UX design, data analytics, application development, artificial intelligence, networking, and security.",
    "ece": "[Placeholder - there are two majors in this category: CE and EE]",
    "mcs": "The Math-Computer Science (B.S) major is a specialized branch of mathematics, providing a focus on computer science. While not covering the same scope as a pure Computer Science major, Math CS prepares students to potentially work in a computing setting. Students are given flexibility in their course subjects, allowing the opportunity to have a greater focus on mathematics or to take a more even distribution of courses in mathematics and computer science. Students study subjects including abstract algebra, statistics and probability, combinatorics, algorithm analysis, programming, and data structures.",
    "sci": "[Placeholder - there are two departments in this category: math and physics]",
    "ica": "The Interdisciplinary Computing and the Arts major (ICAM) is an exciting blend of computer science, art, and technology that explores today’s cutting-edge media. Access to a wide range of disciplines means that students are free to tailor the program to their artistic interests, and can take classes in fields like virtual reality, design communication, film production, and physical electronics programming. ICAM students gain technical, theoretical, and historical backgrounds that prepare them to anticipate and work with emerging trends in art, music, and technology. They can choose from either music technology or visual arts focuses, which influence their upper-level coursework, but often draw from both fields during their journey through the major.",
    "spc": "The Speculative Design (B.A.) major mixes art, science, and emerging technology, with a focus on aesthetics, entrepreneurship, and activist intervention. Combining laboratory and field research in a creative studio setting, Speculative Design works from nano to urban scales to stimulate new ideas and innovative solutions. Rather than focusing on existing methodologies, this program prepares students to solve problems that will emerge in an uncertain future. Students may choose from four areas of emphasis: Public Culture and Urban Ecology, Design Computing, Design Research, and Media Design. ",
    "dat": "Data science majors use mathematical models and computational methods to craft powerful data analysis and meet the emerging needs of data-driven industries, from manufacturing companies to government organizations. The core knowledge base of the data scientist lies at the intersection of computing and mathematics, coupled with the skills to abstract, build, and test predictive and descriptive models. Students in the program can expect coursework in mathematics, computer science, and statistics, as well as foundational lower division coursework in natural and physical sciences."
  },
  "resources": [
    {
      "name": "Envision Maker Studio",
      "description": "Located in the Structural Materials and Engineering Building (SME 306), The EnVision Arts and Engineering Maker Studio at is a hands-on, experiential education facility where visual arts and engineering communities converge. The nearly 3,000 square foot studio provides a wide range of design, fabrication and prototyping tools, both analog and digital. Resources include workstations with CAD and Adobe CC software installed, 3d Printers, soldering stations, a laser cutter, and a vacuum former. The studio is accessible for Engineering or Visual Arts majors, and students enrolled in courses currently offered within the studio. 1",
      "mapImage": "/img/sme.jpg",
      "mapLink": "map1link",
      "link": "testlink1",
      "image": "/img/temp1.svg",
      "tags": [
        "as",
        "bs",
        "ws",
        "sc"
      ]
    },
    {
      "name": "Tech Lending Program",
      "description": "description 2",
      "mapImage": "/img/CommBldg.jpg",
      "mapLink": "map2link",
      "link": "testlink2",
      "image": "/img/temp1.svg",
      "tags": [
        "eq",
        "sc"
      ]
    },
    {
      "name": "name 3",
      "description": "description 3",
      "mapImage": "/img/temp1.svg",
      "mapLink": "map3link",
      "link": "testlink3",
      "image": "/img/temp1.svg",
      "tags": [
        "eq",
        "sc",
        "ev"
      ]
    }
  ],
  "resourceTags": {
    "as": "Academic Support",
    "bs": "Buildings",
    "ev": "Events",
    "sc": "Showcases",
    "eq": "Equipment",
    "ws": "Workspaces"
  },
  "projects": [
    {
      "name": "me-mo",
      "organization": "Personal Project",
      "description": "Cognitive Science students develop a mobile personal travelling app to document their travels. \n\nFor the course COGS 120 (Interaction Design) with Professor Philip Guo, students develop a quarter-long project where they design and develop a mobile application within a given premise. In response to the topic Visualizing and Interacting with Histories, Tori Duong (‘18), Melissa Ngu (‘17), and Ed Ngai (‘17) wondered how they might help people represent and interact with histories in a visual way. Their solution was “me-mo”, a personal traveling app that helps users keep track of places they’ve been to or want to visit in the future. The team of three approached the project by first studying the needs of users and using storyboards to illustrate the different personas and scenarios in which their app would be used. Working with criticism and review from their classmates, the team went on to rapid prototyping and developing low-fidelity wireframes which were then tested on users. Their final project incorporates a wide array of techniques and insight gained from the COGS 120 course. \n\nThe COGS 120 (Interaction Design) course is structured through weekly skill-building assignments and regular small design studio sessions designed to foster constructive conversations around each team’s progress throughout the quarter. ",
      "members": [
        "Tori Duong",
        "Melissa Ngu",
        "Ed Ngai"
      ],
      "link": "http://toriduong.com/me-mo.html",
      "tags": ["ma"]
    },
    {
      "name": "Studyspace.me",
      "organization": "CSE 110",
      "description": "Computer Science students develop a casual social platform for studying, collaboration, and meetings. \n\nFor the course CSE 110 (Software Engineering), students are offered the opportunity to learn common software practices used in industry on an application which they build with a small team of developers. Each team has one quarter to create a project that demonstrates a creative solution to a problem.\n\nAs their solution, the Studyspace team developed a website that connects students with peers and instructors instantly via video and text chat. Through the application, classmates can collaborate in course-specific channels to tackle challenging topics, ask questions, and prepare for exams. The website provides a multifaceted digital workspace that can host a range of activities, like TA office hours, group study sessions, and even a lounge area where students can share music and chat.\n\nThe project boasts a mix of techniques and backend software implementations, including Express.js, Firebase, MongoDB, and PeerJS. Studyspace also incorporates creative frontend and visual design features like alternate app color schemes and day/night modes that ensure the site is easy on the eyes for long periods of time. \n\nThe CSE 110 (Software Engineering) course focuses on an introduction to software development and engineering methods, including specification, design, implementation, testing, and process, as well as an emphasis on team development, agile methods, and use of tools as IDE's, version control, and test harnesses.",
      "members": [
        "Eric Zhang",
        "Isaac Wang",
        "Andy Hwang",
        "Gates Zeng",
        "Michael Youssef",
        "Saurabh Kulkarni",
        "Anish Sinha",
        "Luke Thomas",
        "Zaki Siddiqui",
        "Kent Vuong"
      ],
      "link": "https://www.studyspace.me/",
      "tags": ["wa"]
    },
    {
      "name": "KAi Human Robot Arm",
      "organization": "Divergent Engineering",
      "description": "Engineering students craft a humanoid robot hand with the help of an Arduino microcontroller. \n\nKAi is a human robot based on the open source humanoid robot, “Inmoov”. The Divergent Engineering team successfully built an operational arm with five human-like fingers controlled using five flex sensors. The arm is controlled by an Arduino Uno wired to several potentiometers that recreate the motion of human hands with animatronic “joints”.\n\nThe team has programmed KAi to be autonomous with certain preset hand signs, such as the peace sign. KAi is even able to play a game of rock-paper-scissors with the user motioning out the game’s commonly used hand signs. Using the newly developed muscle sensors, which allows user muscle movement to be recorded by the Arduino,  the team plans to implement a glove-like mechanism to control the fingers.",
      "members": [
        "Alex Phan"
      ],
      "link": "http://divergentengineering.weebly.com/kai-human-robot.html",
      "tags": ["ar"]
    },
    {
      "name": "California Micromouse Competition",
      "organization": "IEEE",
      "description": "CAMM is a collegiate engineering competition where teams compete to create the best maze-solving robots. \n\nThe Micromouse competition has been around since its introduction by IEEE in 1977, and since 2006 we have been working on our own Micromouse projects here in UC San Diego to compete with other schools. The competition featured a 16x16 grid maze and was led by a wall-following robot-mouse, with objective to solve the maze as fast as possible without outside assistant or human control. To meet with popular demand, since 2011 we have hosted our own competition called the California Micromouse Competition (CAMM) at UC San Diego. Every year, IEEE at UC San Diego receives more than 200 applications and are able to sponsor 40 UC San Diego students to participate in the Micromouse Project, and we also have multiple schools from the west coast attending our competition.\n\nIn 2016, more than half of the awards at CAMM Competition was won by UCSD teams. They are: 2nd Place (Kevin Tain), Most Cells Traversed (Will Bui, Austin Hermida, Jocelyn Tran, Achint Singh, Andy Zhang), Design Award (Javier Urquizu, Eddie Calva, Christopher Lew, Nahoon Hwang), and Judge’s Favorite (Fengjunyan Li, Austin Xiao, Haoran Wang, Zhouhang Shao, Haocheng Liang). This project is an opportunity for students to learn and apply various hands-on skills critical for electrical engineers and computer scientists, including EagleCAD, digital signal processing, and microcontroller programming. Other than the technical skills, it is equally important for students to develop collaboration and research skills to help them along the way working in a competitive environment.",
      "members": [
      ],
      "link": "http://micromouseusa.com/",
      "tags": ["ar"]
    },
    {
      "name": "Endless",
      "organization": "Personal Project",
      "description": "Endless is a looping, psychological videogame developed in the Computer Programming for the Arts course.\n\nEndless is a looping, psychological videogame developed for the course VIS 141A (Computer Programming for the Arts I) by Interdisciplinary Computing & the Arts student Oliver Engel (‘18). Using the Unity 3D engine, a series of basic puzzles are presented to the player, who is given a time limit to complete each. Upon completing the series of puzzles, the player is thrown back to the first puzzle, and finds that the controls and perspective have been altered, causing the puzzle to increase in difficulty. Each successive loop continues to distort the player’s experience, activating swirling walls of music and overwhelming sensory information as the game progresses. The game acts as a test of endurance in the face of information saturation and only rewards the user with a high score, depending on the amount of loops completed.\n\nThe game was completed with techniques and skills taught in the project-based VIS 141A course under Professor Brett Stalbaum, which allows students to gain API fluency through planning and coding software or software mediated art projects. In particular, this game was programmed with the C++ language and designed in Unity 3D.",
      "members": [
        "Oliver Engel"
      ],
      "link": "",
      "tags": ["ga"]
    },
    {
      "name": "Potholes in San Diego",
      "organization": "",
      "description": "Working with immense amounts of data, a team of cognitive science students tackle the growing pothole problem in San Diego.\n\n“People have become so desensitized to potholes that their frustration with them has become an everyday routine. For the safety of people and their cars, we asked, what approaches can be taken towards increasing the efficiency of pothole repair? And where should San Diego be allocating their pothole workers and resources?”\n\nThose were the questions asked by a team of students taking the COGS 108 (Data Science in Practice) course. Working with immense amounts of public data, the team first generated visual heat maps of San Diego potholes with the help of the ArcGIS program. They then compared pothole data with a range of other conditions, including the presence of bus stops, parking meters, and population. Using statistical algorithms, computer programming languages, and industry-standard software, the team was able to analyze the complex relations between all of the factors and develop recommendations for how the city of San Diego might begin to solve their issues with potholes. The project demonstrates the practicality of a computing-based approach in data science.",
      "members": [
        "Lee Anne Mercado",
        "Maggie Chan",
        "Tim Lee",
        "Vinh Doan",
        "Young Jin Yun"
      ],
      "link": "https://github.com/tjl014/Projects/blob/master/Potholes%20in%20San%20Diego.ipynb",
      "tags": ["da"]
    },
    {
      "name": "Arduino Pong",
      "organization": "2017 H.A.R.D. Hack",
      "description": "The Arduino Pong project, created during the 2017 H.A.R.D. Hack at UCSD,  is a modern take on the classic game, Pong.\n\nThe game is designed to be a single player Pong game where the user faces the upper edge of the screen, a randomly generated horizontal wall, and a pong ball with gradually increasing speed. The user must maneuver a small platform, the paddle, to prevent the moving pong ball from passing the lower edge of the screen.\n\nThe screen is split in half where the left side of the display is the actual game, while the right side is a score tracker. The score can be arbitrarily set to determine a winner, for example, the team normally tests the game with a set score of 15.\n\nThe project was built using an Arduino Uno with 1 output and 1 input. For the output, the team daisy chained four 8x8 LED matrices to create a 64x64 grid of red LEDs to create the display screen for the player. For the input, the player uses a traditional joystick, which controls the paddle.",
      "members": [
        "Austin Hermida",
        "Eric Ho",
        "Jeffry Jaman"
      ],
      "link": "https://www.youtube.com/watch?v=3nQwyJF6FP8&feature=youtu.be",
      "tags": ["ar"]
    },
    {
      "name": "",
      "organization": "",
      "description": "",
      "members": [
        "",
        ""
      ],
      "link": "",
      "tags": [""]
    }
  ],
  "projectTags": {
    "ma": "Mobile App",
    "wa": "Web App",
    "ar": "Arduino",
    "da": "Datamining",
    "re": "Research",
    "ga": "Games"
  },
  "orgs": [
    {
      "name": "org1",
      "description": "description1",
      "orgImage": "img/temp1.svg",
      "link": "testlink1",
      "tags": ["ad"]
    },
    {
      "name": "org2",
      "description": "description2",
      "orgImage": "img/temp1.svg",
      "link": "testlink2",
      "tags": [
        "ad",
        "cs",
        "en",
        "ms"
      ]
    },
    {
      "name": "org3",
      "description": "description3",
      "orgImage": "img/temp1.svg",
      "link": "testlink3",
      "tags": [
        "en",
        "ad",
        "ms"
      ]
    }
  ],
  "orgTags": {
    "ad": "Arts & Design",
    "cs": "Computer Science",
    "en": "Engineering",
    "ms": "Math & Science"
  }
}
